'use strict';

var allSkills=[
    {
      "name": "先锋剑",
      "lv": 1,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动物理攻击\n威力：200",
      "dmg": 200
    },
    {
      "name": "战逃反应",
      "lv": 2,
      "type": "能力",
      "read": 0,
      "cd": 60,
      "intro": "一定时间内，自身发动物理攻击造成的伤害提高25%\n持续时间：25秒",
      "duration": 25
    },
    {
      "name": "暴乱剑",
      "lv": 4,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动物理攻击　威力：100\n连击条件：先锋剑　连击中威力：300\n连击成功：恢复自身魔力",
      "dmg": 300
    },
    {
      "name": "全蚀斩",
      "lv": 6,
      "type": "战技",
      "read": 0,
      "intro": "对自身周围的敌人发动范围物理攻击\n威力： 120"
    },
    {
      "name": "盾牌猛击",
      "lv": 10,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动物理攻击\n威力： 110\n追加效果： 眩晕\n持续时间： 6秒"
    },
    {
      "name": "钢铁信念",
      "lv": 10,
      "type": "能力",
      "read": 0,
      "cd": 10,
      "intro": "极大幅度增加战斗时获得的仇恨量\n再次发动时则取消该状态\n持续时间： 永久"
    },
    {
      "name": "投盾",
      "lv": 15,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动远距离物理攻击\n威力：120\n追加效果：提升仇恨",
      "dmg": 120
    },
    {
      "name": "战女神之怒",
      "lv": 26,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动物理攻击\n威力：100\n连击条件：暴乱剑\n连击中威力：350",
      "dmg": 350
    },
    {
      "name": "深奥之灵",
      "lv": 30,
      "type": "能力",
      "read": 0,
      "cd": 30,
      "intro": "对目标发动物理攻击\n威力：370\n自身剩余体力越高威力越大\n追加效果：恢复自身魔力",
      "dmg": 370
    },
    {
      "name": "盾阵",
      "lv": 35,
      "type": "能力",
      "read": 0,
      "cd": 5,
      "cost": "「忠义」50",
      "intro": "一定时间内，受到攻击必定会发动格挡\n持续时间：6秒\n发动条件：忠义50点",
      "duration": 6
    },
    {
      "name": "预警",
      "lv": 38,
      "type": "能力",
      "read": 0,
      "cd": 120,
      "intro": "一定时间内，将自身所受的伤害减轻30%\n持续时间：10秒",
      "duration": 10
    },
    {
      "name": "日珥斩",
      "lv": 40,
      "type": "战技",
      "read": 0,
      "intro": "对自身周围的敌人发动范围物理攻击\n威力：100\n连击条件：全蚀斩\n连击中威力：220\n连击成功：恢复自身魔力\n变更内容",
      "dmg": 220
    },
    {
      "name": "保护",
      "lv": 45,
      "type": "能力",
      "read": 0,
      "cd": 120,
      "cost": "「忠义」50",
      "intro": "替目标队员承受来自敌人的攻击\n但对部分攻击无效\n持续时间：12秒\n与目标的距离不能超过10米\n效果发动条件：忠义50点",
      "duration": 12
    },
    {
      "name": "厄运流转",
      "lv": 50,
      "type": "能力",
      "read": 0,
      "cd": 25,
      "intro": "对自身周围的敌人发动范围物理攻击\n威力：120\n追加效果：持续伤害\n威力：35\n持续时间：15秒",
      "dmg": 35,
      "duration": 15
    },
    {
      "name": "神圣领域",
      "lv": 50,
      "type": "能力",
      "read": 0,
      "cd": 420,
      "intro": "一定时间内，除特定攻击之外其他所有对自身发动的攻击均无效\n持续时间：10秒",
      "duration": 10
    },
    {
      "name": "沥血剑",
      "lv": 54,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动物理攻击\n威力：100\n连击条件：暴乱剑\n连击中威力：390\n连击成功：持续伤害\n威力：85\n持续时间：21秒",
      "dmg": 85,
      "duration": 21
    },
    {
      "name": "圣光幕帘",
      "lv": 56,
      "type": "能力",
      "read": 0,
      "cd": 90,
      "intro": "自身受到自身及队员的治疗魔法时，为周围15米内的队员张开防护罩\n持续时间：30秒\n受到治疗效果的同时，该技能效果消失\n防护罩效果（受到攻击时）：抵消相当于骑士自身最大体力10%的伤害量\n持续时间：30秒",
      "duration": 30
    },
    {
      "name": "深仁厚泽",
      "lv": 58,
      "type": "魔法",
      "read": 1.5,
      "cost": "魔力2000",
      "intro": "恢复目标的体力\n恢复力：1200\n追加效果：对小队队员发动该技能时，自身恢复目标所恢复体力的一半"
    },
    {
      "name": "王权剑",
      "lv": 60,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动物理攻击\n威力：100\n连击条件：暴乱剑\n连击中威力：550\n连击成功：3档忠义之剑\n持续时间：15秒",
      "dmg": 550,
      "duration": 15
    },
    {
      "name": "干预",
      "lv": 62,
      "type": "能力",
      "read": 0,
      "cd": 10,
      "cost": "「忠义」50",
      "intro": "指定一名队员，令其受到的伤害减轻10%\n持续时间：6秒\n追加效果：自身处于铁壁、预警状态时，目标也会获得50%的效果\n追加效果发动条件：铁壁或预警状态中\n发动条件：忠义50点",
      "duration": 6
    },
    {
      "name": "圣灵",
      "lv": 64,
      "type": "魔法",
      cd:2.5,
      "read": 1.5,
      "cost": "魔力2000",
      "intro": "对目标发动无属性魔法攻击\n威力：350",
      "dmg": 350
    },
    {
      "name": "安魂祈祷",
      "lv": 68,
      "type": "能力",
      "read": 0,
      "cd": 60,
      "intro": "对目标发动无属性魔法攻击\n威力：550\n自身剩余魔力越高威力越大\n追加效果（自身当前魔力在最大魔力的80%以上时）：自身发动攻击魔法的伤害及治疗魔法的治疗量提高50%\n同时，咏唱魔法不需要咏唱时间\n持续时间：12秒",
      "dmg": 550,
      "duration": 12
    },
    {
      "name": "武装戍卫",
      "lv": 70,
      "type": "能力",
      "read": 0,
      "cd": 120,
      "intro": "向自身后方扇形范围展开减轻伤害的防护区域\n效果时间内自身的格挡发动率变为100%，范围内的队员受到的伤害减轻15%\n持续时间：18秒\n效果时间内发动技能或进行移动、转身都会立即解除武装戍卫\n发动之后会停止自动攻击",
      "duration": 18
    },
    {
      "name": "圣环",
      "lv": 72,
      "type": "魔法",
      "read": 1.5,
      "cost": "魔力2000",
      "intro": "对自身周围的敌人发动无属性范围魔法攻击　威力：250\n变更内容",
      "dmg": 250
    },
    {
      "name": "调停",
      "lv": 74,
      "type": "能力",
      "read": 0,
      "cd": 30,
      "intro": "冲向目标并发动物理攻击\n威力：200\n积蓄次数：2\n止步状态下无法发动",
      "dmg": 200
    },
    {
      "name": "赎罪剑",
      "lv": 76,
      "type": "战技",
      "read": 0,
      "intro": "对目标发动物理攻击\n威力：550\n追加效果：恢复自身魔力\n发动条件：忠义之剑",
      "dmg": 550
    },
    {
      "name": "悔罪",
      "lv": 80,
      "type": "魔法",
      "read": 0,
      cd:2.5,
      "cost": "魔力2000",
      "intro": "对目标及其周围的敌人发动无属性范围魔法攻击\n威力：800\n发动后会取消安魂祈祷状态\n发动条件：安魂祈祷状态中",
      "dmg": 800
    },
    {
      "name": "铁壁",
      "lv": 8,
      "type": "能力",
      "read": 0,
      "cd": 90,
      "intro": "一定时间内，将自身所受的伤害减轻20%\n持续时间：20秒",
      "duration": 20
    },
    {
      "name": "下踢",
      "lv": 12,
      "type": "能力",
      "read": 0,
      "cd": 25,
      "intro": "令目标陷入眩晕状态\n持续时间：5秒",
      "duration": 5
    },
    {
      "name": "挑衅",
      "lv": 15,
      "type": "能力",
      "read": 0,
      "cd": 30,
      "intro": "向目标进行挑衅，令目标对自身的仇恨变为最高后，继续提高自身仇恨"
    },
    {
      "name": "插言",
      "lv": 18,
      "type": "能力",
      "read": 0,
      "cd": 30,
      "intro": "中断目标的技能咏唱"
    },
    {
      "name": "雪仇",
      "lv": 22,
      "type": "能力",
      "read": 0,
      "cd": 60,
      "intro": "目标的攻击伤害降低10%　持续时间：5秒",
      "duration": 5
    },
    {
      "name": "亲疏自行",
      "lv": 32,
      "type": "能力",
      "read": 0,
      "cd": 120,
      "intro": "为自身张开一个防护罩，一定时间内令除特定攻击之外其他所有击退与吸引效果失效　持续时间：6秒\n防护罩追加效果（受到物理攻击时，发动几率100%）：攻击者减速20%　持续时间：15秒",
      "duration": 6
    },
    {
      "name": "退避",
      "lv": 48,
      "type": "能力",
      "read": 0,
      "cd": 120,
      "intro": "将自身仇恨的25%转移给目标队员"
    },{
        "name": "重劈",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：200",
        "dmg": 200
      },
      {
        "name": "凶残裂",
        "lv": 4,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：重劈　连击中威力：300\n连击成功：获得10点兽魂",
        "dmg": 300
      },
      {
        "name": "狂暴",
        "lv": 6,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，自身攻击必定暴击并且直击\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "超压斧",
        "lv": 10,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出扇形范围物理攻击\n威力：130",
        "dmg": 130
      },
      {
        "name": "守护",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "极大幅度增加战斗时获得的仇恨量\n再次发动时则取消该状态\n持续时间：永久"
      },
      {
        "name": "飞斧",
        "lv": 15,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动远距离物理攻击\n威力：140\n追加效果：提升仇恨",
        "dmg": 140
      },
      {
        "name": "暴风斩",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：凶残裂　连击中威力：380\n连击成功：恢复自身体力　恢复力：250\n连击成功：获得20点兽魂",
        "dmg": 380
      },
      {
        "name": "战栗",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，自身的最大体力提高20%\n同时，自身所受的体力恢复效果提高20%\n发动时恢复最大体力的20%\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "原初之魂",
        "lv": 35,
        "type": "战技",
        "read": 0,
        "cost": "「兽魂」50",
        "intro": "对目标发动物理攻击　威力：350\n发动条件：兽魂50点",
        "dmg": 350
      },
      {
        "name": "复仇",
        "lv": 38,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，令自身所受到的伤害减轻30%，同时受到物理攻击时会给予对方反击伤害\n威力：55　持续时间：10秒",
        "dmg": 55,
        "duration": 10
      },
      {
        "name": "秘银暴风",
        "lv": 40,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：100\n连击条件：超压斧　连击中威力：200\n连击成功：暴风碎的持续时间延长10秒\n最多可延长至30秒\n连击成功：获得20点兽魂",
        "dmg": 200
      },
      {
        "name": "死斗",
        "lv": 42,
        "type": "能力",
        "read": 0,
        "cd": 240,
        "intro": "效果中除特定攻击之外其他所有对自身发动的攻击均无法令体力减少到1以下\n当目标为敌人时，禁止目标移动\n持续时间：6秒",
        "duration": 6
      },
      {
        "name": "钢铁旋风",
        "lv": 45,
        "type": "战技",
        "read": 0,
        "cost": "「兽魂」50",
        "intro": "对自身周围的敌人发动范围物理攻击\n威力：220\n发动条件：兽魂50点",
        "dmg": 220
      },
      {
        "name": "暴风碎",
        "lv": 50,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击\n威力：100\n连击条件：凶残裂　连击中威力：380\n连击成功：攻击伤害提高10%\n持续时间：30秒\n连击成功：获得10点兽魂",
        "dmg": 380,
        "duration": 30
      },
      {
        "name": "战嚎",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "获得50点兽魂\n追加效果：原初的混沌\n持续时间：30秒\n积蓄次数：2\n发动条件：自身处于战斗状态",
        "duration": 30
      },
      {
        "name": "裂石飞环",
        "lv": 54,
        "type": "战技",
        "read": 0,
        "cost": "「兽魂」50",
        "intro": "对目标发动物理攻击　威力：590\n该技能在原初的混沌状态中会变为狂魂\n发动条件：兽魂50点",
        "dmg": 590
      },
      {
        "name": "原初的直觉",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 25,
        "intro": "一定时间内，自身所受的伤害减轻20%\n持续时间：5秒\n与原初的勇猛共享复唱时间",
        "duration": 5
      },
      {
        "name": "泰然自若",
        "lv": 58,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "恢复自身体力　恢复力：1200"
      },
      {
        "name": "地毁人亡",
        "lv": 60,
        "type": "战技",
        "read": 0,
        "cost": "「兽魂」50",
        "intro": "对自身周围的敌人发动范围物理攻击　威力：250\n该技能在原初的混沌状态中会变为混沌旋风\n发动条件：兽魂50点",
        "dmg": 250
      },
      {
        "name": "猛攻",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "cost": "「兽魂」20",
        "intro": "冲向目标并发动物理攻击　威力：100\n发动条件：兽魂20点\n止步状态下无法发动",
        "dmg": 100
      },
      {
        "name": "动乱",
        "lv": 64,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "cost": "「兽魂」20",
        "intro": "对目标发动物理攻击　威力：450\n发动条件：兽魂20点",
        "dmg": 450
      },
      {
        "name": "摆脱",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "为自身与周围队员附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于目标最大体力12%的伤害量\n另外，自身处于“战栗”“复仇”“原初的直觉”状态时，每解除一个状态，防护罩的效果量上升2%\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "原初的解放",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内不需要消耗兽魂就可以发动特定技能，且自身攻击必定暴击并且直击\n效果时间内，自身不会受到眩晕、睡眠、止步、加重和除特定攻击之外其他所有击退、吸引的影响\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "混沌旋风",
        "lv": 72,
        "type": "战技",
        "read": 0,
        "cost": "「兽魂」50",
        "intro": "对自身周围的敌人发动范围物理攻击　威力：400\n该技能必定暴击并且直击\n追加效果：战嚎的复唱时间缩短5秒\n发动后会取消原初的混沌状态\n发动条件：原初的混沌状态中且兽魂50点\n\n※该技能无法设置到热键栏",
        "dmg": 400
      },
      {
        "name": "原初的勇猛",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 25,
        "intro": "以一名队员为目标\n对自身附加原初的勇猛状态，对目标附加原初的武猛状态\n原初的勇猛效果：自身的物理攻击命中后恢复体力\n原初的武猛效果：恢复战士自身恢复体力50%的体力同时受到的伤害减轻10%\n持续时间：6秒\n与原初的直觉共享复唱时间",
        "duration": 6
      },
      {
        "name": "狂魂",
        "lv": 80,
        "type": "战技",
        "read": 0,
        "cost": "「兽魂」50",
        "intro": "对目标发动物理攻击　威力：920\n该技能必定暴击并且直击\n追加效果：战嚎的复唱时间缩短5秒\n发动后会取消原初的混沌状态\n发动条件：原初的混沌状态中且兽魂50点\n\n※该技能无法设置到热键栏",
        "dmg": 920
      },{
        "name": "重斩",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击\n威力：200",
        "dmg": 200
      },
      {
        "name": "吸收斩",
        "lv": 2,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击\n威力：100\n连击条件：重斩　连击中威力：300\n连击成功：恢复自身魔力",
        "dmg": 300
      },
      {
        "name": "释放",
        "lv": 6,
        "type": "魔法",
        "read": 0,
        "intro": "对自身周围的敌人发动无属性范围魔法攻击\n威力：150",
        "dmg": 150
      },
      {
        "name": "深恶痛绝",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "极大幅度增加战斗时获得的仇恨量\n再次发动时则取消该状态\n持续时间：永久"
      },
      {
        "name": "伤残",
        "lv": 15,
        "type": "魔法",
        "read": 0,
        "intro": "对目标发动无属性魔法攻击\n威力：150\n追加效果：提升仇恨",
        "dmg": 150
      },
      {
        "name": "噬魂斩",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击\n威力：100\n连击条件：吸收斩　连击时威力：400\n连击成功：恢复自身体力\n恢复力：300\n连击成功：获得20点暗血",
        "dmg": 400
      },
      {
        "name": "暗黑波动",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 2,
        "cost": "魔力3000",
        "intro": "向目标所在方向发出无属性直线范围魔法攻击\n威力：250\n追加效果：暗黑\n持续时间：30秒\n暗黑效果：攻击伤害提高10%\n若自身已经附加暗黑状态，则持续时间延长30秒\n最多可延长至60秒\n与暗黑锋共享复唱时间",
        "dmg": 250,
        "duration": 30
      },
      {
        "name": "嗜血",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "一定时间内，自身的战技及魔法命中时可以恢复魔力\n同时获得10点暗血\n当范围攻击命中复数敌人时，效果只发动1次\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "暗影墙",
        "lv": 38,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，自身受到的伤害减轻30%\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "暗黑锋",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 2,
        "cost": "魔力3000",
        "intro": "对目标发动无属性魔法攻击\n威力：350\n追加效果：暗黑\n持续时间：30秒\n暗黑效果：攻击伤害提高10%\n若自身已经附加暗黑状态，则持续时间延长30秒\n最多可延长至60秒\n与暗黑波动共享复唱时间",
        "dmg": 350,
        "duration": 30
      },
      {
        "name": "弃明投暗",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "一定时间内，令自身所受到的魔法伤害减轻20%\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "行尸走肉",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 300,
        "intro": "对自身附加行尸走肉状态\n效果中受到致命伤也不会陷入无法战斗状态，代价是自身体力降为1且该状态变为死而不僵状态　持续时间：10秒\n死而不僵效果：所有对自身发动的攻击均无法令体力减少到1以下\n效果中得到相当于自身最大体力100%的恢复量即可解除该状态\n如恢复量不足以解除状态直到持续时间结束，自身将陷入无法战斗状态　持续时间：10秒\n以上两种状态均对部分攻击无效",
        "duration": 10
      },
      {
        "name": "腐秽大地",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "以指定地点为中心产生腐秽区域\n所有进入该区域的目标都会受到无属性伤害\n威力：60　持续时间：15秒",
        "dmg": 60,
        "duration": 15
      },
      {
        "name": "跳斩",
        "lv": 54,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "跃向目标并发动物理攻击\n威力：200\n积蓄次数：2\n止步状态下无法发动",
        "dmg": 200
      },
      {
        "name": "吸血深渊",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "以目标为中心发动无属性范围魔法攻击　威力：200\n追加效果：恢复自身体力　恢复力：200",
        "dmg": 200
      },
      {
        "name": "精雕怒斩",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对目标发动物理攻击　威力：450\n追加效果：恢复自身魔力",
        "dmg": 450
      },
      {
        "name": "血溅",
        "lv": 62,
        "type": "战技",
        "read": 0,
        "cost": "「暗血」50",
        "intro": "对目标发动物理攻击\n威力：600\n发动条件：暗血50点",
        "dmg": 600
      },
      {
        "name": "寂灭",
        "lv": 64,
        "type": "战技",
        "read": 0,
        "cost": "「暗血」50",
        "intro": "对自身周围的敌人发动范围物理攻击\n威力：210\n发动条件：暗血50点",
        "dmg": 210
      },
      {
        "name": "血乱",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，不需要消耗暗血就可以发动寂灭和血溅\n寂灭和血溅命中时恢复自身魔力\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "至黑之夜",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "cost": "魔力3000",
        "intro": "为自身或一名队员附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于目标最大体力25%的伤害量\n持续时间：7秒\n防护罩因吸收到足够的伤害而消失时，暗黑骑士自身附加暗技状态",
        "duration": 7
      },
      {
        "name": "刚魂",
        "lv": 72,
        "type": "魔法",
        "read": 0,
        "intro": "对自身周围的敌人发动无属性范围魔法攻击\n威力：100\n连击条件：释放　连击中威力：160\n连击成功：恢复自身魔力\n连击成功：获得20点暗血",
        "dmg": 160
      },
      {
        "name": "暗影波动",
        "lv": 74,
        "type": "能力",
        "read": 0,
        "cd": 2,
        "cost": "魔力3000",
        "intro": "向目标所在方向发出无属性直线范围魔法攻击　威力：300\n追加效果：暗黑\n持续时间：30秒\n暗黑效果：攻击伤害提高10%\n若自身已经附加暗黑状态，则持续时间延长30秒\n最多可延长至60秒\n与暗影锋共享复唱时间",
        "dmg": 300,
        "duration": 30
      },
      {
        "name": "暗影锋",
        "lv": 74,
        "type": "能力",
        "read": 0,
        "cd": 2,
        "cost": "魔力3000",
        "intro": "对目标发动无属性魔法攻击\n威力：500\n追加效果：暗黑\n持续时间：30秒\n暗黑效果：攻击伤害提高10%\n若自身已经附加暗黑状态，则持续时间延长30秒\n最多可延长至60秒\n与暗影波动共享复唱时间",
        "dmg": 500,
        "duration": 30
      },
      {
        "name": "暗黑布道",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内自身与周围队员的所受到的魔法伤害减轻10%\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "掠影示现",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "cost": "「暗血」50",
        "intro": "令“英雄的掠影”变为实体与自身并肩作战\n持续时间：24秒\n发动条件：暗血50点",
        "duration": 24
      },{
        "name": "利刃斩",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：200",
        "dmg": 200
      },
      {
        "name": "无情",
        "lv": 2,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "一定时间内，自身发动攻击造成的伤害提高20%\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "残暴弹",
        "lv": 4,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：利刃斩　连击中威力：300\n连击成功：恢复自身体力　恢复力：150\n同时为自身附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于恢复量100%的伤害\n持续时间：10秒",
        "dmg": 300,
        "duration": 10
      },
      {
        "name": "伪装",
        "lv": 6,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，自身的招架发动率提高50%，所受的伤害减轻10%\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "恶魔切",
        "lv": 10,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：150",
        "dmg": 150
      },
      {
        "name": "王室亲卫",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "极大幅度增加战斗时获得的仇恨量\n再次发动时则取消该状态　持续时间：永久"
      },
      {
        "name": "闪雷弹",
        "lv": 15,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动远距离物理攻击　威力：150\n追加效果：提升仇恨",
        "dmg": 150
      },
      {
        "name": "危险领域",
        "lv": 18,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标发动物理攻击　威力：350",
        "dmg": 350
      },
      {
        "name": "迅连斩",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：残暴弹　连击中威力：400\n连击成功：晶壤",
        "dmg": 400
      },
      {
        "name": "爆发击",
        "lv": 30,
        "type": "战技",
        "read": 0,
        "cost": "「晶壤」1",
        "intro": "对目标发动物理攻击　威力：500\n发动条件：晶壤\n变更内容",
        "dmg": 500
      },
      {
        "name": "星云",
        "lv": 38,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，将自身所受的伤害减轻30%\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "恶魔杀",
        "lv": 40,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击威力：100\n连击条件：恶魔切　连击中威力：250\n连击成功：晶壤",
        "dmg": 250
      },
      {
        "name": "极光",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "令目标体力持续恢复　恢复力：200　持续时间：18秒",
        "duration": 18
      },
      {
        "name": "超火流星",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 360,
        "intro": "发动该技能后，自身的体力降为1，同时在持续时间内，除一部分特定攻击之外，免除自身受到的任何伤害\n持续时间：8秒\n变更内容",
        "duration": 8
      },
      {
        "name": "音速破",
        "lv": 54,
        "type": "战技",
        "read": 0,
        "cd": 60,
        "intro": "对目标发动物理攻击　威力：300\n追加效果：持续伤害\n威力：90　持续时间：30秒\n该战技有单独计算的复唱时间",
        "dmg": 90,
        "duration": 30
      },
      {
        "name": "粗分斩",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "跃向目标并发动物理攻击　威力：200\n积蓄次数：2\n止步状态下无法发动",
        "dmg": 200
      },
      {
        "name": "烈牙",
        "lv": 60,
        "type": "战技",
        "read": 0,
        "cd": 30,
        "cost": "「晶壤」1",
        "intro": "对目标发动物理攻击　威力：450\n追加效果：撕喉预备\n持续时间：10秒\n发动条件：晶壤\n该战技有单独计算的复唱时间",
        "dmg": 450,
        "duration": 10
      },
      {
        "name": "猛兽爪",
        "lv": 60,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：550\n连击条件：烈牙\n追加效果：裂膛预备\n持续时间：10秒\n发动条件：满足连击条件",
        "dmg": 550,
        "duration": 10
      },
      {
        "name": "凶禽爪",
        "lv": 60,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：650\n连击条件：猛兽爪\n追加效果：穿目预备\n持续时间：10秒\n发动条件：满足连击条件",
        "dmg": 650,
        "duration": 10
      },
      {
        "name": "弓形冲波",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：200\n追加效果：持续伤害\n威力：90　持续时间：15秒",
        "dmg": 90,
        "duration": 15
      },
      {
        "name": "光之心",
        "lv": 64,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，令自身和周围队员所受到的魔法伤害减轻10%\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "石之心",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 25,
        "intro": "令自身或一名队员受到的伤害减轻15%\n持续时间：7秒\n追加效果：对队员使用时，若自身附加了残暴弹状态，则目标队员也会附加该状态　持续时间：10秒",
        "duration": 10
      },
      {
        "name": "续剑",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "对目标发动追击\n使用烈牙后可以发动撕喉，使用猛兽爪后可以发动裂膛，使用凶禽爪后可以发动穿目"
      },
      {
        "name": "撕喉",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "对目标发动物理攻击　威力：260\n发动条件：撕喉预备状态中\n\n※该技能无法设置到热键栏",
        "dmg": 260
      },
      {
        "name": "裂膛",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "对目标发动物理攻击　威力：280\n发动条件：裂膛预备状态中\n\n※该技能无法设置到热键栏",
        "dmg": 280
      },
      {
        "name": "穿目",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "对目标发动物理攻击　威力：300\n发动条件：穿目预备状态中\n\n※该技能无法设置到热键栏",
        "dmg": 300
      },
      {
        "name": "命运之环",
        "lv": 72,
        "type": "战技",
        "read": 0,
        "cost": "「晶壤」1",
        "intro": "对自身周围的敌人发动范围物理攻击　威力：320\n发动条件：晶壤",
        "dmg": 320
      },
      {
        "name": "血壤",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "以一名敌人为目标\n对自身附加2档晶壤"
      },
      {
        "name": "爆破领域",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标发动物理攻击　威力：800",
        "dmg": 800
      },{
        "name": "飞石",
        "lv": 1,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动土属性魔法攻击　威力：140",
        "dmg": 140
      },
      {
        "name": "治疗",
        "lv": 2,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "恢复目标的体力　恢复力：450\n追加效果（发动几率15%）：令下次发动的救疗不消耗魔力\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "疾风",
        "lv": 4,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动风属性魔法攻击　威力：50\n追加效果：风属性持续伤害\n威力：30　持续时间：18秒",
        "dmg": 30,
        "duration": 18
      },
      {
        "name": "医治",
        "lv": 10,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力1000",
        "intro": "恢复自身及周围队员的体力　恢复力：300"
      },
      {
        "name": "复活",
        "lv": 12,
        "type": "魔法",
        "read": 8,
        "cost": "魔力2400",
        "intro": "令无法战斗的目标以衰弱状态重新振作起来"
      },
      {
        "name": "水流环",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标造成止步效果　持续时间：6秒",
        "duration": 6
      },
      {
        "name": "坚石",
        "lv": 18,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动土属性魔法攻击　威力：200",
        "dmg": 200
      },
      {
        "name": "救疗",
        "lv": 30,
        "type": "魔法",
        "read": 2,
        "cost": "魔力1000",
        "intro": "恢复目标的体力　恢复力：700"
      },
      {
        "name": "神速咏唱",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 150,
        "intro": "一定时间内，自身的自动攻击间隔、魔法的咏唱及复唱时间缩短20%\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "再生",
        "lv": 35,
        "type": "魔法",
        "read": 0,
        "cost": "魔力500",
        "intro": "令目标体力持续恢复　恢复力：200　持续时间：18秒",
        "duration": 18
      },
      {
        "name": "愈疗",
        "lv": 40,
        "type": "魔法",
        "read": 2,
        "cost": "魔力1500",
        "intro": "恢复目标及其周围队员的体力　恢复力：550"
      },
      {
        "name": "神圣",
        "lv": 45,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力600",
        "intro": "对周围的敌人发动无属性范围魔法攻击　威力：140\n追加效果：眩晕　持续时间：4秒",
        "dmg": 140,
        "duration": 4
      },
      {
        "name": "烈风",
        "lv": 46,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动风属性魔法攻击　威力：60\n追加效果：风属性持续伤害\n威力：60　持续时间：18秒",
        "dmg": 60,
        "duration": 18
      },
      {
        "name": "医济",
        "lv": 50,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力1300",
        "intro": "恢复自身及周围队员的体力　\n恢复力：200\n追加效果：目标体力持续恢复\n恢复力：100　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "天赐祝福",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "令目标体力完全恢复"
      },
      {
        "name": "安慰之心",
        "lv": 52,
        "type": "魔法",
        "read": 0,
        "cost": "「治疗百合」1",
        "intro": "恢复目标的体力　恢复力：700\n追加效果：血百合开放\n发动条件：治疗百合"
      },
      {
        "name": "庇护所",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "以指定地点为中心产生治疗区域\n恢复进入该区域的队员体力\n恢复力：100　持续时间：24秒\n追加效果：区域内的自身和队员所受的体力恢复效果提高10%",
        "duration": 24
      },
      {
        "name": "垒石",
        "lv": 54,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动土属性魔法攻击　威力：240",
        "dmg": 240
      },
      {
        "name": "法令",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 45,
        "intro": "对周围的敌人发动无属性范围魔法攻击　威力：400\n追加效果：恢复自身及周围队员的体力\n恢复力：400\n追加效果：恢复自身最大魔力的5%",
        "dmg": 400
      },
      {
        "name": "无中生有",
        "lv": 58,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内发动魔法消耗的魔力降低100%\n持续时间：12秒",
        "duration": 12
      },
      {
        "name": "神名",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "恢复目标的体力　恢复力：700"
      },
      {
        "name": "崩石",
        "lv": 64,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动土属性魔法攻击　威力：280",
        "dmg": 280
      },
      {
        "name": "神祝祷",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "为自身或一名队员附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于500恢复力的伤害量\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "全大赦",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "为自身与周围队员附加全大赦状态　持续时间：10秒\n在状态中使用医治、愈疗、医济、狂喜之心，会使目标产生额外的恢复效果\n恢复力：200",
        "duration": 10
      },
      {
        "name": "天辉",
        "lv": 72,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：120\n追加效果：无属性持续伤害\n威力：60　持续时间：30秒",
        "dmg": 60,
        "duration": 30
      },
      {
        "name": "闪耀",
        "lv": 72,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：300",
        "dmg": 300
      },
      {
        "name": "苦难之心",
        "lv": 74,
        "type": "魔法",
        "read": 0,
        "cost": "「血百合」3",
        "intro": "对目标及其周围的敌人发动无属性范围魔法攻击　威力：900\n攻击复数目标时，每多1目标，对该目标威力降低10%，最低降为50%\n发动条件：血百合完全开放",
        "dmg": 900
      },
      {
        "name": "狂喜之心",
        "lv": 76,
        "type": "魔法",
        "read": 0,
        "cost": "「治疗百合」1",
        "intro": "恢复自身及周围队员的体力\n恢复力：300\n追加效果：血百合开放\n发动条件：治疗百合"
      },
      {
        "name": "节制",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，自身发动治疗魔法的治疗量提高20%，自身与30米以内的队员受到的伤害减轻10%　持续时间：20秒",
        "duration": 20
      },
      {
        "name": "沉静",
        "lv": 8,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力600",
        "intro": "令目标陷入睡眠状态　持续时间：30秒\n发动之后会停止自动攻击",
        "duration": 30
      },
      {
        "name": "康复",
        "lv": 10,
        "type": "魔法",
        "read": 1,
        "cost": "魔力400",
        "intro": "解除目标身上部分弱化效果中的一种"
      },
      {
        "name": "即刻咏唱",
        "lv": 18,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "一定时间内，下次咏唱的魔法没有任何咏唱时间\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "醒梦",
        "lv": 24,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "持续恢复自身魔力\n效果量：50　持续时间：21秒",
        "duration": 21
      },
      {
        "name": "沉稳咏唱",
        "lv": 44,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，咏唱的魔法不会被任何妨碍打断\n同时，令除特定攻击之外其他所有击退与吸引效果失效\n持续时间：6秒",
        "duration": 6
      },
      {
        "name": "营救",
        "lv": 48,
        "type": "能力",
        "read": 0,
        "cd": 150,
        "intro": "将目标队员吸引到自己身边\n目标身中部分弱化效果或处于非战斗状态时无效\n发动条件：自身处于战斗状态"
      },{
        "name": "毁灭",
        "lv": 1,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：160",
        "dmg": 160
      },
      {
        "name": "毒菌",
        "lv": 2,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标附加无属性持续伤害状态\n威力：20　持续时间：30秒",
        "dmg": 20,
        "duration": 30
      },
      {
        "name": "医术",
        "lv": 4,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "恢复目标的体力　恢复力：400"
      },
      {
        "name": "朝日召唤",
        "lv": 4,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力200",
        "intro": "召唤朝日小仙女\n朝日小仙女会对体力减少的队员自动使用仙光的拥抱"
      },
      {
        "name": "夕月召唤",
        "lv": 4,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力200",
        "intro": "召唤夕月小仙女\n夕月小仙女会对体力减少的队员自动使用仙光的拥抱"
      },
      {
        "name": "复生",
        "lv": 12,
        "type": "魔法",
        "read": 8,
        "cost": "魔力2400",
        "intro": "令无法战斗的目标以衰弱状态重新振作起来"
      },
      {
        "name": "仙光的低语",
        "lv": 20,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "命令小仙女发动仙光的低语\n炽天使同行时，命令炽天使发动天使的低语\n发动条件：小仙女或炽天使处于同行状态"
      },
      {
        "name": "猛毒菌",
        "lv": 26,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标附加无属性持续伤害状态\n威力：40　持续时间：30秒",
        "dmg": 40,
        "duration": 30
      },
      {
        "name": "鼓舞激励之策",
        "lv": 30,
        "type": "魔法",
        "read": 2,
        "cost": "魔力1000",
        "intro": "恢复目标的体力　恢复力：300\n追加效果：为目标附加能够抵御一定伤害的防护罩鼓舞\n鼓舞效果：抵消相当于治疗量125%的伤害\n持续时间：30秒\n无法与占星术士的黑夜领域效果叠加\n追加效果（暴击时）：为目标附加能够抵御一定伤害的防护罩激励\n激励效果：抵消相当于治疗量125%的伤害\n持续时间：30秒",
        "duration": 30
      },
      {
        "name": "士气高扬之策",
        "lv": 35,
        "type": "魔法",
        "read": 2,
        "cost": "魔力1300",
        "intro": "恢复自身及周围队员的体力\n恢复力：180\n追加效果：附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于治疗量125%的伤害\n持续时间：30秒\n无法与占星术士的黑夜领域效果叠加",
        "duration": 30
      },
      {
        "name": "毁坏",
        "lv": 38,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：200",
        "dmg": 200
      },
      {
        "name": "异想的幻光",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "命令小仙女发动异想的幻光\n炽天使同行时，命令炽天使发动炽天的幻光\n发动条件：小仙女或炽天使处于同行状态"
      },
      {
        "name": "以太超流",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "恢复自身最大魔力的10%\n追加效果：最大档数的以太超流\n最大档数：3档　持续时间：永久\n发动条件：自身处于战斗状态"
      },
      {
        "name": "能量吸收",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "cost": "「以太超流」1",
        "intro": "对目标发动无属性魔法攻击　威力：150\n追加效果：恢复伤害量一定比例的体力\n同时恢复自身魔力\n追加效果：获得10点异想以太\n发动条件：以太超流",
        "dmg": 150
      },
      {
        "name": "生命活性法",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「以太超流」1",
        "intro": "恢复目标的体力　恢复力：600\n追加效果：获得10点异想以太\n发动条件：以太超流"
      },
      {
        "name": "破阵法",
        "lv": 46,
        "type": "魔法",
        "read": 0,
        "cost": "魔力600",
        "intro": "对周围的敌人发动无属性范围魔法攻击　威力：160",
        "dmg": 160
      },
      {
        "name": "野战治疗阵",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "cost": "「以太超流」1",
        "intro": "以指定地点为中心产生减轻伤害的防护区域\n区域内的队员所受到的伤害会减轻10%，同时持续恢复队员体力\n恢复力：100　持续时间：15秒\n,区域内的队员所受到的伤害会减轻10%　持续时间：15秒\n追加效果：获得10点异想以太\n发动条件：以太超流",
        "duration": 15
      },
      {
        "name": "不屈不挠之策",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "cost": "「以太超流」1",
        "intro": "恢复自身及周围队员的体力\n恢复力：400\n追加效果：获得10点异想以太\n发动条件：以太超流"
      },
      {
        "name": "气炎法",
        "lv": 54,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：240",
        "dmg": 240
      },
      {
        "name": "展开战术",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "令自身或目标所带的鼓舞状态向周围队员身上扩散\n持续时间：扩散时状态的剩余持续时间\n自身没有对目标附加鼓舞状态时无效"
      },
      {
        "name": "应急战术",
        "lv": 58,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "效果时间内自身发动1次带有鼓舞及激励状态的治疗魔法时，将鼓舞及激励效果转化为同等数值的体力恢复效果　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "转化",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "回收小仙女的同时为自身附加最大档数的以太超流状态\n并且自身发动治疗魔法的治疗量提高20%\n持续时间：30秒\n但是效果时间内无法咏唱朝日召唤及夕月召唤\n效果时间结束后小仙女会重新被召唤出来\n发动条件：自身处于战斗状态且小仙女处于同行状态",
        "duration": 30
      },
      {
        "name": "深谋远虑之策",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 45,
        "cost": "「以太超流」1",
        "intro": "为自身或一名队员附加“体力低于50%时或持续时间结束后自动恢复”状态　恢复力：800\n持续时间：45秒\n追加效果：获得10点异想以太\n发动条件：以太超流",
        "duration": 45
      },
      {
        "name": "魔炎法",
        "lv": 64,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：260",
        "dmg": 260
      },
      {
        "name": "连环计",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，目标被暴击率提高10%　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "以太契约",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "cost": "「异想以太」10",
        "intro": "命令召唤出的小仙女对自身或一名队员发动异想的融光\n再次发动时则取消该状态\n发动条件：异想以太10点\n异想以太获得条件：自身处于战斗状态且小仙女或炽天使处于同行状态，消耗以太超流的技能成功生效"
      },
      {
        "name": "融光解除",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "将异想的融光状态解除"
      },
      {
        "name": "蛊毒法",
        "lv": 72,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标附加无属性持续伤害状态\n威力：60　持续时间：30秒",
        "dmg": 60,
        "duration": 30
      },
      {
        "name": "死炎法",
        "lv": 72,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：280",
        "dmg": 280
      },
      {
        "name": "秘策",
        "lv": 74,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "效果时间内，自身发动的1次鼓舞激励之策、士气高扬之策、不屈不挠之策、深谋远虑之策可以不消耗魔力及以太超流，并且必定暴击　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "异想的祥光",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "cost": "「异想以太」10",
        "intro": "命令小仙女发动异想的祥光\n发动条件：小仙女处于同行状态且异想以太10点"
      },
      {
        "name": "炽天召唤",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "回收小仙女，召唤炽天使　召唤时间：20秒\n炽天使会对体力减少的队员自动使用炽天的幕帘\n炽天使消失后，小仙女会重新被召唤出来\n发动条件：小仙女处于同行状态"
      },
      {
        "name": "慰藉",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "命令炽天使发动慰藉\n积蓄次数：2\n发动条件：炽天使处于同行状态"
      },
      {
        "name": "仙光的拥抱",
        "lv": 1,
        "type": "魔法",
        "read": 0,
        "cd": 3,
        "intro": "恢复目标的体力　恢复力：150\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "仙光的低语",
        "lv": 20,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "持续恢复周围队员的体力\n恢复力：120　持续时间：21秒\n\n※该技能无法设置到热键栏",
        "duration": 21
      },
      {
        "name": "异想的幻光",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "一定时间内周围队员发动治疗魔法的治疗量提高10%，受到的魔法伤害减轻5%\n持续时间：20秒\n无法与炽天使的炽天的幻光效果叠加\n\n※该技能无法设置到热键栏",
        "duration": 20
      },
      {
        "name": "异想的融光",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": null,
        "cost": "「异想以太」",
        "intro": "持续恢复目标的体力\n恢复力：400\n发动后持续消耗异想以太\n且小仙女无法进行其他行动\n效果发动条件：与目标的距离不超过15米\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "异想的祥光",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "恢复周围队员的体力 恢复力：350\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "炽天的幕帘",
        "lv": 80,
        "type": "魔法",
        "read": 0,
        "cd": 3,
        "intro": "恢复目标的体力　恢复力：200\n追加效果：为目标附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于治疗量100%的伤害\n持续时间：30秒\n\n※该技能无法设置到热键栏",
        "duration": 30
      },
      {
        "name": "天使的低语",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "持续恢复周围队员的体力\n恢复力：120　持续时间：21秒\n\n※该技能无法设置到热键栏",
        "duration": 21
      },
      {
        "name": "炽天的幻光",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "一定时间内周围队员发动治疗魔法的治疗量提高10%，受到的魔法伤害减轻5%\n持续时间：20秒\n无法与小仙女的异想的幻光效果叠加\n\n※该技能无法设置到热键栏\n变更内容",
        "duration": 20
      },
      {
        "name": "慰藉",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "恢复周围队员的体力\n恢复力：300\n追加效果：为目标附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于治疗量100%的伤害\n持续时间：30秒\n\n※该技能无法设置到热键栏",
        "duration": 30
      },{
        "name": "凶星",
        "lv": 1,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：150",
        "dmg": 150
      },
      {
        "name": "吉星",
        "lv": 2,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "恢复目标的体力　恢复力：400\n追加效果（发动几率15%）：下次福星必定会发动暴击\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "烧灼",
        "lv": 4,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标附加无属性持续伤害状态\n威力：30　持续时间：18秒",
        "dmg": 30,
        "duration": 18
      },
      {
        "name": "光速",
        "lv": 6,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，自身的魔法咏唱时间缩短2.5秒，消耗魔力减少50%　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "阳星",
        "lv": 10,
        "type": "魔法",
        "read": 2,
        "cost": "魔力900",
        "intro": "恢复自身及周围队员的体力\n恢复力：330"
      },
      {
        "name": "生辰",
        "lv": 12,
        "type": "魔法",
        "read": 8,
        "cost": "魔力2400",
        "intro": "令无法战斗的目标以衰弱状态重新振作起来"
      },
      {
        "name": "先天禀赋",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 40,
        "intro": "恢复目标的体力　恢复力：400\n目标剩余体力越少，恢复力越高\n积蓄次数：2"
      },
      {
        "name": "福星",
        "lv": 26,
        "type": "魔法",
        "read": 2,
        "cost": "魔力900",
        "intro": "恢复目标的体力　恢复力：700"
      },
      {
        "name": "抽卡",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "抽取一张奥秘卡\n出卡会变为抽到的奥秘卡技能"
      },
      {
        "name": "白昼学派",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 5,
        "intro": "自身的部分治疗系技能会附加持续恢复体力效果\n再次发动时则取消该状态　持续时间：永久\n无法与黑夜学派同时使用\n与黑夜学派共享复唱时间\n自身处于战斗状态时无法取消该状态或切换至黑夜学派状态,自身处于战斗状态时无法取消该状态"
      },
      {
        "name": "奥秘卡废弃",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "将抽到的奥秘卡废弃\n发动条件：奥秘卡抽卡状态中"
      },
      {
        "name": "出卡",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "发动抽卡后，该技能变为抽到的奥秘卡技能\n对自身或一名队员使用该技能，可令奥秘卡生效\n只能同时附加1种奥秘卡效果\n发动条件：抽卡状态中"
      },
      {
        "name": "吉星相位",
        "lv": 34,
        "type": "魔法",
        "read": 0,
        "cost": "魔力500",
        "intro": "恢复目标的体力　恢复力：200\n“白昼学派”状态中追加效果：目标体力持续恢复\n恢复力：200　持续时间：15秒\n该持续恢复效果只能同时附加1个\n“黑夜学派”状态中追加效果：为目标附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于治疗量250%的伤害\n持续时间：30秒\n无法与学者的鼓舞效果叠加\n发动条件：白昼学派或黑夜学派状态中",
        "duration": 30
      },
      {
        "name": "重抽",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "重新抽取一张与现有卡不同的奥秘卡\n积蓄次数：3\n发动条件：抽卡状态中"
      },
      {
        "name": "阳星相位",
        "lv": 42,
        "type": "魔法",
        "read": 2,
        "cost": "魔力1100",
        "intro": "恢复自身及周围队员的体力\n恢复力：200\n“白昼学派”状态中追加效果：目标体力持续恢复\n恢复力：100　持续时间：15秒\n该持续恢复效果只能同时附加1个\n“黑夜学派”状态中追加效果：为目标附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于治疗量125%的伤害\n持续时间：30秒\n无法与学者的鼓舞效果叠加\n发动条件：白昼学派或黑夜学派状态中",
        "duration": 30
      },
      {
        "name": "重力",
        "lv": 45,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力600",
        "intro": "对目标及其周围的敌人发动无属性范围魔法攻击　威力：140",
        "dmg": 140
      },
      {
        "name": "炽灼",
        "lv": 46,
        "type": "魔法",
        "read": 0,
        "cost": "魔力500",
        "intro": "对目标附加无属性持续伤害状态\n威力：35　持续时间：30秒",
        "dmg": 35,
        "duration": 30
      },
      {
        "name": "黑夜学派",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 5,
        "intro": "自身的部分治疗系技能会附加能够抵消一定伤害的防护罩\n同时，吉星相位消耗的魔力会有所增加\n再次发动时则取消该状态　持续时间：永久\n无法与白昼学派同时使用\n与白昼学派共享复唱时间\n自身处于战斗状态时无法取消该状态或切换至白昼学派状态"
      },
      {
        "name": "星位合图",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "指定一名队员为配对目标，在对自身或队员咏唱单体治疗魔法时，配对目标也会恢复治疗量40%的体力\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "小奥秘卡",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "将抽取的奥秘卡变为王冠之领主或王冠之贵妇\n抽到太阳神之衡、放浪神之箭、战争神之枪时发动该技能，抽取的奥秘卡将变为王冠之领主；抽到世界树之干、河流神之瓶、建筑神之塔时发动该技能，抽取的奥秘卡将变为王冠之贵妇\n发动条件：抽卡状态中"
      },
      {
        "name": "占卜",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "cost": "全部「占卜量谱的标识」",
        "intro": "令自身与周围队员发动攻击造成的伤害提高\n该技能的效果量随占卜量谱的日、月、星的种类数目而变化。\n1种标识时效果量：4%\n2种标识时效果量：5%\n3种标识时效果量：6%\n持续时间：15秒\n自身处于战斗状态时使用卡片技能，可以获得占卜量谱的“日”“月”“星”标识\n发动条件：占卜量谱的标识数积累到3个",
        "duration": 15
      },
      {
        "name": "灾星",
        "lv": 54,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：170",
        "dmg": 170
      },
      {
        "name": "命运之轮",
        "lv": 58,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "以自身为中心产生命运之轮\n命运之轮效果：范围内的队员所受到的伤害会减轻10%　持续时间：18秒\n范围内的队员还会附加体力持续恢复的效果　恢复力：50　持续时间：15秒\n效果时间内发动技能或进行移动、转身都会使命运之轮立即消失\n发动之后会停止自动攻击",
        "duration": 15
      },
      {
        "name": "天星冲日",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "恢复自身及周围队员的体力\n恢复力：200\n“白昼学派”状态中追加效果：目标体力持续恢复\n恢复力：100　持续时间：15秒\n该持续恢复效果只能同时附加1个\n“黑夜学派”状态中追加效果：为目标附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于治疗量125%的伤害\n持续时间：30秒\n发动条件：白昼学派或黑夜学派状态中",
        "duration": 30
      },
      {
        "name": "地星",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "在指定地点设置地星，并为自身附加地星主宰状态　持续时间：10秒\n地星主宰持续时间内再次使用此技能，则会发动星体破裂，对范围内的敌人进行无属性魔法攻击　威力：100\n追加效果：恢复范围内自身与队员的体力\n恢复力：540\n持续时间结束后，地星获得强化，并为自身附加巨星主宰状态　持续时间：10秒\n巨星主宰的持续时间结束时，或时间内再次使用此技能，则会发动星体爆炸，对范围内的敌人进行无属性魔法攻击\n威力：150\n追加效果：恢复范围内自身与队员的体力\n恢复力：720",
        "dmg": 150,
        "duration": 10
      },
      {
        "name": "星体爆轰",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "发动设置在地面的地星\n“地星主宰”状态中：对范围内的敌人发动无属性魔法攻击\n威力：100\n追加效果：恢复范围内自身与队员的体力\n恢复力：540\n“巨星主宰”状态中：对范围内的敌人发动无属性魔法攻击\n威力：150\n追加效果：恢复范围内自身与队员的体力\n恢复力：720",
        "dmg": 150
      },
      {
        "name": "祸星",
        "lv": 64,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：210",
        "dmg": 210
      },
      {
        "name": "袖内抽卡",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "抽取一张奥秘卡\n出卡会变为抽到的奥秘卡技能\n追加效果：2档袖内抽卡\n袖内抽卡效果：使用出卡后会立即抽取一张奥秘卡\n持续时间：30秒",
        "duration": 30
      },
      {
        "name": "焚灼",
        "lv": 72,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标附加无属性持续伤害状态\n威力：45　持续时间：30秒",
        "dmg": 45,
        "duration": 30
      },
      {
        "name": "煞星",
        "lv": 72,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：240",
        "dmg": 240
      },
      {
        "name": "天星交错",
        "lv": 74,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "恢复自身或一名队员的体力\n恢复力：200\n“白昼学派”状态中追加效果：为目标附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于治疗量200%的伤害\n持续时间：30秒\n“黑夜学派”状态中追加效果：目标体力持续恢复\n恢复力：150　持续时间：15秒\n该持续恢复效果只能同时附加1个\n发动条件：白昼学派或黑夜学派状态中",
        "duration": 15
      },
      {
        "name": "天宫图",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对自身和周围队员附加天宫图状态　持续时间：10秒\n天宫图效果时间内受到自身发动的阳星及阳星相位时，天宫图状态变为阳星天宫图状态　持续时间：30秒\n持续时间内再次使用此技能，会恢复附加了天宫图及阳星天宫图状态的自身及周围队员的体力\n天宫图状态恢复力：200\n阳星天宫图状态恢复力：400",
        "duration": 30
      },
      {
        "name": "天宫图",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "恢复自身及周围队员的体力\n该技能的恢复力受目标附加的状态影响\n天宫图状态恢复力：200\n阳星天宫图状态恢复力：400\n发动后会取消天宫图及阳星天宫图状态"
      },
      {
        "name": "中间学派",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，自身发动治疗魔法的治疗量提高20%\n追加效果：使用吉星相位及阳星相位时，同时发动白昼学派和黑夜学派双方的追加效果　持续时间：20秒",
        "duration": 20
      }, {
        "name": "连击",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：150\n连击效果提高时威力：300\n“魔猿身形”中追加效果：背面攻击必定暴击\n追加效果：盗龙身形　持续时间：15秒",
        "dmg": 300,
        "duration": 15
      },
      {
        "name": "正拳",
        "lv": 4,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：220\n背面攻击威力：240\n追加效果：猛豹身形　持续时间：15秒\n发动条件：盗龙身形状态中",
        "dmg": 240,
        "duration": 15
      },
      {
        "name": "崩拳",
        "lv": 6,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：210\n侧面攻击威力：230\n追加效果：魔猿身形　持续时间：15秒\n追加效果：疾风迅雷　持续时间：16秒\n疾风迅雷效果：攻击伤害提高10%，自动攻击间隔、战技与魔法的咏唱及复唱时间缩短5%\n发动条件：猛豹身形状态中",
        "dmg": 230,
        "duration": 16
      },
      {
        "name": "金刚体势",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "令自身受到的伤害减轻10%\n再次发动时则取消该状态　持续时间：永久\n无法与红莲体势、疾风体势同时使用\n与红莲体势、疾风体势共享复唱时间"
      },
      {
        "name": "双掌打",
        "lv": 18,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：150\n侧面攻击威力：170\n追加效果：攻击伤害提高10%\n持续时间：15秒\n追加效果：猛豹身形　持续时间：15秒\n发动条件：盗龙身形状态中",
        "dmg": 170,
        "duration": 15
      },
      {
        "name": "破坏神冲",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：80\n“魔猿身形”中威力：110\n追加效果：盗龙身形　持续时间：15秒",
        "dmg": 110,
        "duration": 15
      },
      {
        "name": "破碎拳",
        "lv": 30,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：70\n背面攻击威力：90\n追加效果：持续伤害\n威力：65　持续时间：18秒\n追加效果：魔猿身形　持续时间：15秒\n追加效果：疾风迅雷　持续时间：16秒\n疾风迅雷效果：攻击伤害提高10%，自动攻击间隔、战技与魔法的咏唱及复唱时间缩短5%\n发动条件：猛豹身形状态中",
        "dmg": 65,
        "duration": 16
      },
      {
        "name": "地烈劲",
        "lv": 30,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：120\n追加效果：魔猿身形　持续时间：15秒\n追加效果：疾风迅雷　持续时间：16秒\n疾风迅雷效果：攻击伤害提高10%，自动攻击间隔、战技与魔法的咏唱及复唱时间缩短5%\n发动条件：猛豹身形状态中",
        "dmg": 120,
        "duration": 16
      },
      {
        "name": "疾风体势",
        "lv": 34,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "令自身移动速度提高\n再次发动时则取消该状态　持续时间：永久\n无法与金刚体势、红莲体势同时使用\n与金刚体势、红莲体势共享复唱时间"
      },
      {
        "name": "罗刹冲",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "冲向目标并发动物理攻击　威力：100\n积蓄次数：2\n止步状态下无法发动",
        "dmg": 100
      },
      {
        "name": "红莲体势",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "令自身攻击造成的伤害提高10%\n再次发动时则取消该状态　持续时间：永久\n无法与金刚体势、疾风体势同时使用\n与金刚体势、疾风体势共享复唱时间"
      },
      {
        "name": "真言",
        "lv": 42,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，自身与周围队员所受的体力恢复效果提高20%　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "四面脚",
        "lv": 45,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：120\n追加效果：双掌打的持续时间延长10秒\n最多可延长至15秒\n追加效果：猛豹身形　持续时间：15秒\n发动条件：盗龙身形状态中",
        "dmg": 120,
        "duration": 15
      },
      {
        "name": "震脚",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内可以无视身形要求发动战技\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "双龙脚",
        "lv": 50,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：180\n侧面攻击威力：200\n“魔猿身形”中追加效果：连击效果提高\n持续时间：30秒\n追加效果：盗龙身形　持续时间：15秒",
        "dmg": 200,
        "duration": 15
      },
      {
        "name": "演武",
        "lv": 52,
        "type": "战技",
        "read": 0,
        "intro": "令自身的拳法身形变换至下一阶段\n当前没有摆出身形时则变换至魔猿身形\n“猛豹身形”状态中追加效果：自身疾风迅雷的持续时间恢复到最大值"
      },
      {
        "name": "斗气",
        "lv": 54,
        "type": "能力",
        "read": 0,
        "cd": 1.2,
        "intro": "对自身附加斗气状态，最多可以积累5档\n持续时间：永久\n自身处于非战斗状态时直接获得5档斗气\n与战技共享复唱时间"
      },
      {
        "name": "阴阳斗气斩",
        "lv": 54,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「斗气5档」",
        "intro": "对目标发动物理攻击　威力：370\n发动后会取消斗气状态\n发动条件：自身处于战斗状态且斗气5档\n与万象斗气圈共享复唱时间\n\n※该技能无法设置到热键栏",
        "dmg": 370
      },
      {
        "name": "苍气炮",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：200",
        "dmg": 200
      },
      {
        "name": "斗魂旋风脚",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "cost": "「疾风迅雷」最大档数",
        "intro": "对目标发动物理攻击　威力：430\n发动后会取消疾风迅雷状态\n发动条件：疾风迅雷最大档数",
        "dmg": 430
      },
      {
        "name": "金刚极意",
        "lv": 64,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "效果时间内受到伤害时对自身附加金刚决意状态\n持续时间：30秒\n并且，自身疾风迅雷的持续时间恢复到最大值\n金刚决意效果：自身所受的伤害减轻10%\n同时无视技能的方向要求\n持续时间：30秒",
        "duration": 30
      },
      {
        "name": "红莲极意",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，自身发动攻击造成的伤害提高25%\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "义结金兰",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "为自身与周围队员附加义结金兰：斗气状态\n自身与周围队员发动战技时有30%几率为自身附加1档斗气\n为自身与周围队员附加义结金兰：攻击状态\n发动物理攻击造成的伤害提高5%\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "万象斗气圈",
        "lv": 74,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「斗气5档」",
        "intro": "向目标所在方向发出直线范围物理攻击　威力：220\n发动后会取消斗气状态\n发动条件：自身处于战斗状态且斗气5档\n与阴阳斗气斩共享复唱时间",
        "dmg": 220
      },
      {
        "name": "无我",
        "lv": 78,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "令自身附加的身形与疾风迅雷的持续时间暂停\n自身处于战斗状态时，疾风迅雷的持续时间恢复到最大值，且不断叠加疾风迅雷状态\n效果时间内发动技能或进行移动、转身都会立即解除无我\n发动之后会停止自动攻击　持续时间：30秒",
        "duration": 30
      },
      {
        "name": "六合星导脚",
        "lv": 80,
        "type": "战技",
        "read": 0,
        "cd": 5,
        "intro": "对目标发动物理攻击　威力：400\n追加效果：自身疾风迅雷的持续时间恢复到最大值\n该战技有单独计算的复唱时间，发动后其他战技与魔法会产生与该战技相同的复唱时间",
        "dmg": 400
      },
      {
        "name": "内丹",
        "lv": 0,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "恢复自身体力\n恢复力：500"
      },
      {
        "name": "扫腿",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 40,
        "intro": "令目标陷入眩晕状态　持续时间：3秒",
        "duration": 3
      },
      {
        "name": "浴血",
        "lv": 12,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，将自身物理攻击所造成伤害的一部分转化为自身的体力\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "牵制",
        "lv": 22,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，令目标的力量与灵巧降低10%\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "真北",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 45,
        "intro": "一定时间内无视技能的方向要求　持续时间：10秒\n积蓄次数：2",
        "duration": 10
      },{
        "name": "精准刺",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：290",
        "dmg": 290
      },
      {
        "name": "贯通刺",
        "lv": 4,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：140\n连击条件：精准刺　连击中威力：350",
        "dmg": 350
      },
      {
        "name": "龙剑",
        "lv": 6,
        "type": "能力",
        "read": 0,
        "cd": 45,
        "intro": "效果时间内，自身发动的1次战技必定打出暴击，并且恢复自身体力\n该效果不适用于持续伤害等状态\n持续时间：5秒",
        "duration": 5
      },
      {
        "name": "贯穿尖",
        "lv": 15,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动远程物理攻击　威力：150",
        "dmg": 150
      },
      {
        "name": "开膛枪",
        "lv": 18,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：150\n连击条件：精准刺　连击中威力：320\n连击成功：攻击伤害提高10%\n持续时间：30秒",
        "dmg": 320,
        "duration": 30
      },
      {
        "name": "直刺",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：贯通刺　连击中威力：530\n“苍天龙血”状态中连击成功：龙牙龙爪效果提高　持续时间：10秒",
        "dmg": 530,
        "duration": 10
      },
      {
        "name": "猛枪",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，自身发动攻击造成的伤害提高15%\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "跳跃",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "跳起接近目标并发动物理攻击　威力：310\n攻击之后回到原位\n追加效果：幻象冲预备\n持续时间：15秒\n止步状态下无法发动",
        "dmg": 310,
        "duration": 15
      },
      {
        "name": "回避跳跃",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "向身后跳出15米距离\n止步状态下无法发动"
      },
      {
        "name": "死天枪",
        "lv": 40,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出直线范围物理攻击　威力：170",
        "dmg": 170
      },
      {
        "name": "破碎冲",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "跳起接近目标并发动物理攻击　威力：240\n止步状态下无法发动",
        "dmg": 240
      },
      {
        "name": "樱花怒放",
        "lv": 50,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n背面攻击威力：140\n连击条件：开膛枪　连击中威力：290\n连击中背面攻击威力：330\n连击成功：持续伤害\n威力：45　持续时间：24秒\n“苍天龙血”中连击成功：龙尾大回旋效果提高　持续时间：10秒",
        "dmg": 45,
        "duration": 10
      },
      {
        "name": "龙炎冲",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "跳起接近目标并发动火属性范围攻击　威力：380\n止步状态下无法发动",
        "dmg": 380
      },
      {
        "name": "战斗连祷",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "一定时间内，自身与周围队员的暴击发动率提高10%\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "苍天龙血",
        "lv": 54,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "一定时间内，高跳和破碎冲的威力提高30%　持续时间：30秒\n直刺成功时追加效果：龙牙龙爪效果提高　持续时间：10秒\n樱花怒放成功时追加效果：龙尾大回旋效果提高　持续时间：10秒\n以上两种状态在苍天龙血状态消失或执行了其他战技时自动解除\n发动条件：非红莲龙血状态中",
        "duration": 10
      },
      {
        "name": "龙牙龙爪",
        "lv": 56,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：320\n侧面攻击威力：360\n追加效果：苍天龙血的持续时间延长10秒\n最多可延长至30秒\n发动条件：苍天龙血及龙牙龙爪效果提高状态中",
        "dmg": 360
      },
      {
        "name": "龙尾大回旋",
        "lv": 58,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：320\n背面攻击威力：360\n追加效果：苍天龙血的持续时间延长10秒\n最多可延长至30秒\n发动条件：苍天龙血及龙尾大回旋效果提高状态中",
        "dmg": 360
      },
      {
        "name": "武神枪",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "cost": "「ドラゴンアイ」2段階",
        "intro": "向目标所在方向发出直线范围物理攻击　威力：270\n发动条件：苍天龙血状态中\n追加效果：苍天龙血变为红莲龙血\n发动条件：龙眼2档",
        "dmg": 270
      },
      {
        "name": "音速刺",
        "lv": 62,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出直线范围物理攻击　威力：100\n连击条件：死天枪　连击中威力：200\n连击成功：苍天龙血的持续时间延长10秒\n最多可延长至30秒",
        "dmg": 200
      },
      {
        "name": "巨龙视线",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "为自身附加巨龙右眼状态\n当指定一名队员为目标时，为自身附加巨龙右眼状态，为目标附加巨龙左眼状态\n巨龙右眼效果：攻击伤害提高10%\n巨龙左眼效果：攻击伤害提高5%\n持续时间：20秒\n与目标的距离超过12米无法发动巨龙左眼的效果",
        "duration": 20
      },
      {
        "name": "幻象冲",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "对目标发动物理攻击　威力：250\n“苍天龙血”或“红莲龙血”状态中追加效果：龙眼\n发动条件：发动跳跃、高跳后对自身附加的幻象冲预备状态中",
        "dmg": 250
      },
      {
        "name": "死者之岸",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "向目标所在方向发出直线范围物理攻击　威力：400\n发动条件：红莲龙血状态中\n\n※该技能无法设置到热键栏",
        "dmg": 400
      },
      {
        "name": "山境酷刑",
        "lv": 72,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出直线范围物理攻击　威力：100\n连击条件：音速刺　连击中威力：230\n连击成功：苍天龙血的持续时间延长10秒\n最多可延长至30秒\n\n变更内容",
        "dmg": 230
      },
      {
        "name": "高跳",
        "lv": 74,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "跳起接近目标并发动物理攻击　威力：400\n攻击之后回到原位\n追加效果：幻象冲预备\n持续时间：15秒\n止步状态下无法发动",
        "dmg": 400,
        "duration": 15
      },
      {
        "name": "龙眼雷电",
        "lv": 76,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：330\n发动条件：龙眼雷电预备状态中\n\n※该技能无法设置到热键栏",
        "dmg": 330
      },
      {
        "name": "坠星冲",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "跳起接近目标并发动火属性范围物理攻击　威力：550\n攻击复数敌人时，对目标之外的敌人威力降低30%\n止步状态下无法发动\n发动条件：红莲龙血状态中\n变更内容",
        "dmg": 550
      },{
        "name": "双刃旋",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：220",
        "dmg": 220
      },
      {
        "name": "残影",
        "lv": 2,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "抵消相当于自身最大体力20%的伤害　持续时间：20秒",
        "duration": 20
      },
      {
        "name": "绝风",
        "lv": 4,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：双刃旋　连击中威力：330",
        "dmg": 330
      },
      {
        "name": "隐遁",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "隐藏自己的身形，大多数敌人都无法发现自己\n不过移动速度会降低50%\n对比自身等级高出10级的怪物以及部分特殊怪物无效\n发动除冲刺以外的其他技能会取消该状态\n持续时间：永久\n追加效果：发动后若处于非战斗状态则重置忍术的复唱时间\n发动条件：自身处于非战斗状态"
      },
      {
        "name": "飞刀",
        "lv": 15,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动远距离物理攻击　威力：120",
        "dmg": 120
      },
      {
        "name": "夺取",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 110,
        "intro": "对目标发动物理攻击　威力：150\n追加效果：用该技能打倒敌人之后有可能会掉落更多的物品\n追加效果：获得40点忍气",
        "dmg": 150
      },
      {
        "name": "攻其不备",
        "lv": 18,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对目标发动物理攻击　威力：340\n背面攻击威力：500\n背面攻击追加效果：受伤加重\n持续时间：10秒\n受伤加重效果：目标所受伤害提高10%\n发动条件：隐遁",
        "dmg": 500,
        "duration": 10
      },
      {
        "name": "旋风刃",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n背面攻击威力：160\n连击条件：绝风　连击中威力：400\n连击中背面攻击威力：460",
        "dmg": 460
      },
      {
        "name": "影牙",
        "lv": 30,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：双刃旋　连击中威力：220\n连击成功：持续伤害\n威力：70　持续时间：24秒",
        "dmg": 70,
        "duration": 24
      },
      {
        "name": "天之印",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 0.5,
        "intro": "结成天之印手势　持续时间：5秒\n与地之印、人之印、忍术共享复唱时间",
        "duration": 5
      },
      {
        "name": "忍术",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "发动忍术，忍术的具体效果随之前结印的顺序有所不同\n在结印状态下发动其他技能会导致忍术失败\n即使没有发动忍术，结印状态消失时也会进入复唱时间\n与天之印、地之印、人之印共享复唱时间"
      },
      {
        "name": "地之印",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 0.5,
        "intro": "结成地之印手势　持续时间：5秒\n与天之印、人之印、忍术共享复唱时间",
        "duration": 5
      },
      {
        "name": "血雨飞花",
        "lv": 38,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：120",
        "dmg": 120
      },
      {
        "name": "缩地",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "迅速移动到指定地点\n积蓄次数：2\n止步状态下无法发动"
      },
      {
        "name": "人之印",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 0.5,
        "intro": "结成人之印手势　持续时间：5秒\n与天之印、地之印、忍术共享复唱时间",
        "duration": 5
      },
      {
        "name": "生杀予夺",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "重置忍术的复唱时间\n并且在效果中发动的忍术威力提高30%　持续时间：15秒\n积蓄次数：2",
        "duration": 15
      },
      {
        "name": "八卦无刃杀",
        "lv": 52,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：100\n连击条件：血雨飞花　连击中威力：140\n连击成功：风遁之术的持续时间延长10秒\n最多可延长至70秒",
        "dmg": 140
      },
      {
        "name": "强甲破点突",
        "lv": 54,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n侧面攻击威力：160\n连击条件：绝风　连击中威力：380\n连击中侧面攻击威力：440\n连击成功：风遁之术的持续时间延长30秒\n最多可延长至70秒",
        "dmg": 440
      },
      {
        "name": "梦幻三段",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对目标发动连续3次物理攻击　威力：200\n追加效果：断绝预备\n持续时间：10秒",
        "dmg": 200,
        "duration": 10
      },
      {
        "name": "断绝",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "对目标发动物理攻击　威力：200\n该技能必定暴击并且直击\n发动条件：发动梦幻三段后附加的断绝预备状态中",
        "dmg": 200
      },
      {
        "name": "通灵之术·大虾蟆",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「忍气」80",
        "intro": "对目标及其周围的敌人发动火属性范围魔法攻击　威力：400\n攻击复数敌人时，对目标之外的敌人威力降低50%\n发动条件：忍气80点\n与六道轮回共享复唱时间",
        "dmg": 400
      },
      {
        "name": "六道轮回",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「忍气」80",
        "intro": "对目标发动无属性魔法攻击　威力：500\n发动条件：忍气80点\n与通灵之术·大虾蟆共享复唱时间",
        "dmg": 500
      },
      {
        "name": "天地人",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 100,
        "intro": "重置忍术的复唱时间\n效果时间内发动的前两个忍术复唱时间缩短为1秒，且发动后不会消耗掉结出的印\n另外，效果时间内发动的忍术威力提升150%\n但无法发动同一个忍术\n持续时间：10秒\n效果时间内无法发动印与忍术之外的技能，移动后会立即解除天地人\n天地人状态结束后，忍术进入复唱时间\n发动条件：非生杀予夺状态中",
        "duration": 10
      },
      {
        "name": "命水",
        "lv": 72,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "消耗自身附加的水遁之术，获得40点忍气\n发动条件：自身处于战斗状态及水遁之术状态中"
      },
      {
        "name": "分身之术",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 110,
        "cost": "「忍气」80",
        "intro": "效果时间内使用战技后，自身的分身会出现并加以追击　持续时间：15秒\n分身的攻击威力固定\n近身攻击威力：200\n远程攻击威力：100\n范围攻击威力：100\n分身的攻击命中时自身获得4点忍气\n发动条件：忍气80点",
        "dmg": 100,
        "duration": 15
      },
      {
        "name": "风魔手里剑",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "对目标发动远距离物理攻击　威力：280\n发动条件：结成“天之印”“地之印”“人之印”任意一种印的状态下发动忍术\n\n※该技能无法设置到热键栏",
        "dmg": 280
      },
      {
        "name": "火遁之术",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "对目标及其周围的敌人发动火属性范围魔法攻击　威力：250\n发动条件：按下列任意一种顺序结印后发动忍术\n“地之印”→“天之印”或\n“人之印”→“天之印”\n\n※该技能无法设置到热键栏",
        "dmg": 250
      },
      {
        "name": "雷遁之术",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "对目标发动雷属性魔法攻击　威力：400\n发动条件：按下列任意一种顺序结印后发动忍术\n“天之印”→“地之印”或\n“人之印”→“地之印”\n\n※该技能无法设置到热键栏",
        "dmg": 400
      },
      {
        "name": "冰遁之术",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "对目标发动冰属性魔法攻击　威力：140\n追加效果：止步　持续时间：15秒\n发动之后会停止自动攻击\n发动条件：按下列任意一种顺序结印后发动忍术\n“天之印”→“人之印”或\n“地之印”→“人之印”\n\n※该技能无法设置到热键栏",
        "dmg": 140,
        "duration": 15
      },
      {
        "name": "风遁之术",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "自身的自动攻击间隔、战技的复唱时间缩短15%　持续时间：70秒\n发动条件：按下列任意一种顺序结印后发动忍术\n“人之印”→“地之印”→“天之印”或\n“地之印”→“人之印”→“天之印”\n\n※该技能无法设置到热键栏",
        "duration": 70
      },
      {
        "name": "土遁之术",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "以自身为中心产生伤害区域，范围内的敌人均会受到土属性伤害\n威力：45　持续时间：24秒\n追加效果：范围内所有目标附加40%加重\n发动条件：按下列任意一种顺序结印后发动忍术\n“天之印”→“人之印”→“地之印”或\n“人之印”→“天之印”→“地之印”\n\n※该技能无法设置到热键栏",
        "dmg": 45,
        "duration": 24
      },
      {
        "name": "水遁之术",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "对目标发动水属性魔法攻击　威力：130\n追加效果：水遁之术\n持续时间：20秒\n水遁之术效果：不用隐遁身形也能够发动需要在隐遁状态下发动的技能1次\n发动条件：按下列任意一种顺序结印后发动忍术\n“天之印”→“地之印”→“人之印”或\n“地之印”→“天之印”→“人之印”\n\n※该技能无法设置到热键栏",
        "dmg": 130,
        "duration": 20
      },
      {
        "name": "劫火灭却之术",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "对目标及其周围的敌人发动火属性范围魔法攻击　威力：400\n发动条件：在生杀予夺效果时间内，按下列任意一种顺序结印后发动忍术\n“地之印”→“天之印”或\n“人之印”→“天之印\n\n※该技能无法设置到热键栏",
        "dmg": 400
      },
      {
        "name": "冰晶乱流之术",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 20,
        "intro": "对目标发动冰属性魔法攻击　威力：600\n发动条件：在生杀予夺效果时间内，按下列任意一种顺序结印后发动忍术\n“天之印”→“人之印”或\n“地之印”→“人之印”\n\n※该技能无法设置到热键栏",
        "dmg": 600
      }, {
        "name": "刃风",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：200\n追加效果：获得5点剑气",
        "dmg": 200
      },
      {
        "name": "阵风",
        "lv": 4,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：刃风　连击中威力：340\n连击成功：攻击伤害提高13%\n持续时间：40秒\n连击成功：获得5点剑气",
        "dmg": 340,
        "duration": 40
      },
      {
        "name": "心眼",
        "lv": 6,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "一定时间内，受到的第一次攻击伤害减轻10%\n持续时间：3秒\n追加效果：成功减轻伤害后对自身附加开眼状态\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "燕飞",
        "lv": 15,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动远距离物理攻击　威力：100\n“燕飞效果提高”状态中威力：320\n追加效果：获得10点剑气",
        "dmg": 320
      },
      {
        "name": "士风",
        "lv": 18,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：刃风　连击中威力：340\n连击成功：自身的自动攻击间隔、战技与魔法的咏唱及复唱时间缩短13%　持续时间：40秒\n连击成功：获得5点剑气",
        "dmg": 340,
        "duration": 40
      },
      {
        "name": "风雅",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：100\n追加效果：获得5点剑气",
        "dmg": 100
      },
      {
        "name": "月光",
        "lv": 30,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：阵风　连击中威力：480\n连击中背面攻击追加效果：获得5点剑气\n连击成功：获得月之闪与5点剑气",
        "dmg": 480
      },
      {
        "name": "居合术",
        "lv": 30,
        "type": "战技",
        "read": 1.3,
        "cost": "「闪」全部",
        "intro": "根据闪的数量发动居合术\n1闪：彼岸花\n2闪：天下五剑\n3闪：纷乱雪月花"
      },
      {
        "name": "满月",
        "lv": 35,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：100\n连击条件：风雅　连击中威力：160\n连击成功：阵风的持续时间延长15秒\n最多可延长至40秒\n连击成功：获得月之闪与10点剑气",
        "dmg": 160
      },
      {
        "name": "花车",
        "lv": 40,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：士风　连击中威力：480\n连击中侧面攻击追加效果：获得5点剑气\n连击成功：获得花之闪与5点剑气",
        "dmg": 480
      },
      {
        "name": "樱花",
        "lv": 45,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：100\n连击条件：风雅　连击中威力：160\n连击成功：士风的持续时间延长15秒\n最多可延长至40秒\n连击成功：获得花之闪与10点剑气",
        "dmg": 160
      },
      {
        "name": "雪风",
        "lv": 50,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：刃风　连击中威力：400\n连击成功：获得雪之闪与15点剑气",
        "dmg": 400
      },
      {
        "name": "明镜止水",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 55,
        "intro": "一定时间内，战技无需连击条件即可连击成功\n持续时间结束或发动3次居合术之外的战技后取消该状态　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "必杀剑·回天",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「剑气」20",
        "intro": "效果时间内发动的第1个战技威力提高50%　持续时间：10秒\n发动条件：剑气20点",
        "duration": 10
      },
      {
        "name": "必杀剑·晓天",
        "lv": 54,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "cost": "「剑气」10",
        "intro": "冲向目标并发动物理攻击　威力：100\n发动条件：剑气10点\n止步状态下无法发动",
        "dmg": 100
      },
      {
        "name": "必杀剑·夜天",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "cost": "「剑气」10",
        "intro": "对目标发动物理攻击　威力：100\n追加效果：后跳10米距离\n追加效果：燕飞效果提高\n持续时间：15秒\n发动条件：剑气10点\n止步状态下无法发动",
        "dmg": 100,
        "duration": 15
      },
      {
        "name": "慈眼",
        "lv": 58,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "恢复自身体力　恢复力：200\n发动条件：开眼状态中\n与必杀剑·星眼共享复唱时间"
      },
      {
        "name": "默想",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "进入默想状态持续获得剑气　持续时间：15秒\n追加效果：连续叠加默想深度状态\n最大档数：5档　持续时间：45秒\n效果时间内发动技能或进行移动、转身都会立即解除默想\n发动之后会停止自动攻击\n非战斗中无法获得剑气，也不会附加默想深度状态",
        "duration": 45
      },
      {
        "name": "必杀剑·震天",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「剑气」25",
        "intro": "对目标发动物理攻击　威力：320\n发动条件：剑气25点",
        "dmg": 320
      },
      {
        "name": "必杀剑·九天",
        "lv": 64,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「剑气」25",
        "intro": "对自身周围的敌人发动范围物理攻击　威力：150\n发动条件：剑气25点",
        "dmg": 150
      },
      {
        "name": "必杀剑·星眼",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「剑气」15",
        "intro": "对目标发动物理攻击　威力：220\n发动条件：剑气15点\n发动条件：开眼状态中\n与慈眼共享复唱时间",
        "dmg": 220
      },
      {
        "name": "叶隐",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 5,
        "cost": "「闪」全部",
        "intro": "将闪转换为剑气\n每一道闪可转换5点剑气\n发动条件：雪之闪或月之闪或花之闪状态中"
      },
      {
        "name": "意气冲天",
        "lv": 68,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "获得50点剑气\n发动条件：自身处于战斗状态"
      },
      {
        "name": "必杀剑·红莲",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "cost": "「剑气」50",
        "intro": "向目标所在方向发出直线范围物理攻击　威力：850\n发动条件：剑气50点\n与必杀剑·闪影共享复唱时间",
        "dmg": 850
      },
      {
        "name": "必杀剑·闪影",
        "lv": 72,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "cost": "「剑气」50",
        "intro": "对目标发动物理攻击　威力：1100\n发动条件：剑气50点\n与必杀剑·红莲共享复唱时间",
        "dmg": 1100
      },
      {
        "name": "燕回返",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "发动上一次使用的居合术\n发动条件：居合术使用完毕\n该能力不仅有单独计算的复唱时间，还会与战技共享复唱时间\n变更内容"
      },
      {
        "name": "照破",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「默想深度」全部",
        "intro": "对目标发动物理攻击\n该技能威力随自身默想深度的档数而变化\n1档时威力：100\n2档时威力：300\n3档时威力：400\n4档时威力：450\n5档时威力：500\n发动时会消耗全部的默想深度\n发动条件：默想深度1档以上\n自身处于战斗状态时发动默想，可以连续叠加“默想深度”状态",
        "dmg": 500
      },
      {
        "name": "彼岸花",
        "lv": 30,
        "type": "战技",
        "read": 1.3,
        "cost": "「闪」全部",
        "intro": "对目标发动物理攻击　威力：250\n追加效果：持续伤害\n威力：40　持续时间：60秒\n\n※该技能无法设置到热键栏",
        "dmg": 40,
        "duration": 60
      },
      {
        "name": "天下五剑",
        "lv": 40,
        "type": "战技",
        "read": 1.3,
        "cost": "「闪」全部",
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：360\n\n※该技能无法设置到热键栏",
        "dmg": 360
      },
      {
        "name": "纷乱雪月花",
        "lv": 50,
        "type": "战技",
        "read": 1.3,
        "cost": "「闪」全部",
        "intro": "对目标发动物理攻击　威力：800\n\n※该技能无法设置到热键栏",
        "dmg": 800
      },
      {
        "name": "回返彼岸花",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对目标发动物理攻击　威力：375\n追加效果：持续伤害\n威力：60　持续时间：60秒\n无法与彼岸花的持续伤害叠加\n该能力不仅有单独计算的复唱时间，还会与战技共享复唱时间\n\n※该技能无法设置到热键栏",
        "dmg": 60,
        "duration": 60
      },
      {
        "name": "回返五剑",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：540\n该能力不仅有单独计算的复唱时间，还会与战技共享复唱时间\n\n※该技能无法设置到热键栏",
        "dmg": 540
      },
      {
        "name": "回返雪月花",
        "lv": 76,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对目标发动物理攻击　威力：1200\n该能力不仅有单独计算的复唱时间，还会与战技共享复唱时间\n\n※该技能无法设置到热键栏",
        "dmg": 1200
      },{
        "name": "强力射击",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：180\n追加效果（发动几率20%）：直线射击预备　持续时间：10秒",
        "dmg": 180,
        "duration": 10
      },
      {
        "name": "直线射击",
        "lv": 2,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：200\n发动条件：直线射击预备状态中",
        "dmg": 200
      },
      {
        "name": "猛者强击",
        "lv": 4,
        "type": "能力",
        "read": 0,
        "cd": 80,
        "intro": "一定时间内，自身发动攻击造成的伤害提高10%\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "毒咬箭",
        "lv": 6,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n追加效果：中毒\n威力：40　持续时间：30秒",
        "dmg": 40,
        "duration": 30
      },
      {
        "name": "失血箭",
        "lv": 12,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "对目标发动物理攻击　威力：150\n与死亡箭雨共享复唱时间",
        "dmg": 150
      },
      {
        "name": "后跃射击",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "射击目标，同时后跳10米距离\n止步状态下无法发动"
      },
      {
        "name": "连珠箭",
        "lv": 18,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：150\n追加效果（发动几率30%）：重置失血箭及死亡箭雨的复唱时间",
        "dmg": 150
      },
      {
        "name": "风蚀箭",
        "lv": 30,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动风属性物理攻击　威力：60\n追加效果：风属性持续伤害\n威力：50　持续时间：30秒",
        "dmg": 50,
        "duration": 30
      },
      {
        "name": "贤者的叙事谣",
        "lv": 30,
        "type": "魔法",
        "read": 0,
        "cd": 80,
        "intro": "对目标发动无属性魔法攻击　威力：100\n弹唱贤者的叙事谣　持续时间：30秒\n追加效果(烈毒咬箭或狂风蚀箭,毒咬箭或风蚀箭的持续伤害命中时，发动几率40%）：诗心\n“诗心”效果：重置失血箭及死亡箭雨的复唱时间\n该魔法有单独计算的复唱时间，不受其他战技和魔法复唱时间的影响",
        "dmg": 100,
        "duration": 30
      },
      {
        "name": "光阴神的礼赞凯歌",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 45,
        "intro": "解除一名队员身上部分弱化效果中的一种\n如果未能触发该效果，则为该队员张开防护罩\n防护罩可免疫一次目标所受到的部分弱化效果中的一种　持续时间：30秒",
        "duration": 30
      },
      {
        "name": "纷乱箭",
        "lv": 38,
        "type": "能力",
        "read": 0,
        "cd": 80,
        "intro": "效果时间内，自身发动的1次单体攻击战技连续发动3次，但该战技的追加效果只发动1次\n持续时间：10秒\n对自身附加直线射击预备状态\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "军神的赞美歌",
        "lv": 40,
        "type": "魔法",
        "read": 0,
        "cd": 80,
        "intro": "对目标发动无属性魔法攻击　威力：100\n弹唱军神的赞美歌　持续时间：30秒\n追加效果（烈毒咬箭或狂风蚀箭,毒咬箭或风蚀箭的持续伤害命中时，发动几率40%）：诗心\n“诗心”效果：每档可令自身的自动攻击间隔、战技与魔法的咏唱及复唱时间缩短4%，最多积累4档\n该魔法有单独计算的复唱时间，不受其他战技和魔法复唱时间的影响",
        "dmg": 100,
        "duration": 30
      },
      {
        "name": "死亡箭雨",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "对目标及其周围敌人发动范围物理攻击　威力：130\n与失血箭共享复唱时间",
        "dmg": 130
      },
      {
        "name": "战斗之声",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "一定时间内，周围队员的直击发动率提高20%\n持续时间：20秒\n发动条件：正在使用贤者的叙事谣、军神的赞美歌、放浪神的小步舞曲任意一种",
        "duration": 20
      },
      {
        "name": "放浪神的小步舞曲",
        "lv": 52,
        "type": "魔法",
        "read": 0,
        "cd": 80,
        "intro": "对目标发动无属性魔法攻击　威力：100\n弹唱放浪神的小步舞曲　持续时间：30秒\n追加效果（烈毒咬箭或狂风蚀箭,毒咬箭或风蚀箭的持续伤害命中时，发动几率40%）：诗心\n“诗心”效果：可发动完美音调，最多积累3档\n该魔法有单独计算的复唱时间，不受其他战技和魔法复唱时间的影响",
        "dmg": 100,
        "duration": 30
      },
      {
        "name": "完美音调",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "cost": "「诗心」全部",
        "intro": "对目标发动物理攻击\n根据自身附加的诗心档数给与相应伤害\n诗心1档时威力：100\n诗心2档时威力：250\n诗心3档时威力：450\n发动条件：放浪神的小步舞曲状态中且诗心1档以上",
        "dmg": 450
      },
      {
        "name": "九天连箭",
        "lv": 54,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "对目标发动物理攻击　威力：230",
        "dmg": 230
      },
      {
        "name": "伶牙俐齿",
        "lv": 56,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n追加效果：重置自身对目标施加的烈毒咬箭和狂风蚀箭,毒咬箭和风蚀箭的持续时间\n自身没有对目标施加上述持续伤害状态时无效\n追加效果（发动几率35%）：直线射击预备　持续时间：10秒",
        "dmg": 100,
        "duration": 10
      },
      {
        "name": "侧风诱导箭",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对目标发动物理攻击　威力：100\n自身对目标附加了烈毒咬箭、狂风蚀箭,毒咬箭、风蚀箭状态时威力提高\n1种持续伤害时威力：175\n2种持续伤害时威力：260\n与影噬箭共享复唱时间",
        "dmg": 260
      },
      {
        "name": "行吟",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "一定时间内，令自身和周围队员所受到的伤害减轻10%\n持续时间：15秒\n无法与机工士的策动、舞者的防守之桑巴效果叠加",
        "duration": 15
      },
      {
        "name": "烈毒咬箭",
        "lv": 64,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：150\n追加效果：中毒\n威力：50　持续时间：30秒\n追加效果（发动几率35%）：直线射击预备　持续时间：10秒",
        "dmg": 50,
        "duration": 10
      },
      {
        "name": "狂风蚀箭",
        "lv": 64,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动风属性物理攻击　威力：100\n追加效果：风属性持续伤害\n威力：60　持续时间：30秒\n追加效果（发动几率35%）：直线射击预备　持续时间：10秒",
        "dmg": 60,
        "duration": 10
      },
      {
        "name": "大地神的抒情恋歌",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "令自身或其他一名队员所受的体力恢复效果提高20%\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "辉煌箭",
        "lv": 70,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：340\n发动条件：直线射击预备状态中",
        "dmg": 340
      },
      {
        "name": "影噬箭",
        "lv": 72,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对目标及其周围敌人发动范围物理攻击　威力：100\n自身对目标附加了烈毒咬箭、狂风蚀箭状态时威力提高\n1种持续伤害时威力：160\n2种持续伤害时威力：220\n与侧风诱导箭共享复唱时间",
        "dmg": 220
      },
      {
        "name": "爆发射击",
        "lv": 76,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：230\n追加效果（发动几率35%）：直线射击预备　持续时间：10秒",
        "dmg": 230,
        "duration": 10
      },
      {
        "name": "绝峰箭",
        "lv": 80,
        "type": "战技",
        "read": 0,
        "cost": "「灵魂之声」20点以上全部",
        "intro": "向目标所在方向发出直线范围物理攻击　威力：500\n发动时会消耗全部的灵魂之声\n灵魂之声消耗量越高威力越大\n发动条件：灵魂之声20点以上\n变更内容",
        "dmg": 500
      },
      {
        "name": "伤腿",
        "lv": 6,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "令目标陷入40%加重状态　持续时间：10秒",
        "duration": 10
      },
      {
        "name": "内丹",
        "lv": 8,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "恢复自身体力　恢复力：500"
      },
      {
        "name": "伤足",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标造成止步效果　持续时间：10秒\n发动之后会停止自动攻击",
        "duration": 10
      },
      {
        "name": "速行",
        "lv": 20,
        "type": "能力",
        "read": 0,
        "cd": 5,
        "intro": "提高自身和周围队员的移动速度\n进入战斗状态后效果消失，并且战斗状态下也无法重新生效\n持续时间：30秒",
        "duration": 30
      },
      {
        "name": "伤头",
        "lv": 24,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "中断目标的技能咏唱"
      }, {
        "name": "分裂弹",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：160\n追加效果：获得5点枪管热度",
        "dmg": 160
      },
      {
        "name": "独头弹",
        "lv": 2,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：分裂弹或热分裂弹\n连击中威力：240\n连击成功：获得5点枪管热度",
        "dmg": 240
      },
      {
        "name": "热弹",
        "lv": 4,
        "type": "战技",
        "read": 0,
        "cd": 40,
        "intro": "对目标发动物理攻击　威力：300\n追加效果：获得20点电能\n该战技有单独计算的复唱时间",
        "dmg": 300
      },
      {
        "name": "整备",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 55,
        "intro": "效果时间内，自身发动的1次战技必定打出暴击并且直击　持续时间：5秒",
        "duration": 5
      },
      {
        "name": "虹吸弹",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标发动物理攻击　威力：150\n积蓄次数：3",
        "dmg": 150
      },
      {
        "name": "散射",
        "lv": 18,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：180\n追加效果：获得5点枪管热度",
        "dmg": 180
      },
      {
        "name": "狙击弹",
        "lv": 26,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：独头弹或热独头弹\n连击中威力：320\n连击成功：获得5点枪管热度\n连击成功：获得10点电能",
        "dmg": 320
      },
      {
        "name": "超荷",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "cost": "「枪管热度」50",
        "intro": "进入过热状态\n效果时间内，自身发动的单体战技威力提高20　持续时间：8秒\n发动条件：枪管热度50点",
        "duration": 8
      },
      {
        "name": "热冲击",
        "lv": 35,
        "type": "战技",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标发动物理攻击　威力：200\n追加效果：虹吸弹和弹射的复唱时间缩短15秒\n发动条件：过热状态\n该战技有单独计算的复唱时间，不受装备和状态的影响",
        "dmg": 200
      },
      {
        "name": "车式浮空炮塔",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 6,
        "cost": "「电能」50",
        "intro": "设置车式浮空炮塔进行援护射击\n车式浮空炮塔的运转时间随发动该技能时消耗的电能而变动\n最长运转时间：15秒\n车式浮空炮塔可以通过齐射进行自动攻击\n对目标发动物理攻击　威力：80\n运转时间结束后，或发动超档车式炮塔后，车式浮空炮塔会被回收\n发动条件：电能50点\n与超档车式炮塔共享复唱时间",
        "dmg": 80
      },
      {
        "name": "超档车式炮塔",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "命令设置的车式浮空炮塔发动超负荷车式炮塔\n发动条件：车式浮空炮塔处于设置状态\n与车式浮空炮塔共享复唱时间"
      },
      {
        "name": "超负荷车式炮塔",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "对目标发动物理攻击　威力：400\n该技能的威力受设置车式浮空炮塔时消耗的电能影响\n发动后车式浮空炮塔消失\n所有者使用超档车式炮塔或车式浮空炮塔的运转时间结束时，车式浮空炮塔会自动执行该技能\n\n※该技能无法设置到热键栏",
        "dmg": 400
      },
      {
        "name": "野火",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "对目标附加野火状态，同时该技能变为起爆\n持续时间结束或发动起爆，可以对目标造成伤害\n该技能的威力随自身在持续时间内对目标命中的战技次数而变化\n每命中1次战技的威力：200\n持续时间：10秒",
        "dmg": 200,
        "duration": 10
      },
      {
        "name": "起爆",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "令敌人附加的野火状态结束，对敌人造成伤害\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "弹射",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标及其周围的敌人发动范围物理攻击　威力：150\n攻击复数敌人时，对目标之外的敌人威力降低50%\n积蓄次数：3",
        "dmg": 150
      },
      {
        "name": "自动弩",
        "lv": 52,
        "type": "战技",
        "read": 0,
        "cd": 1.5,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：180\n发动条件：过热状态\n该战技有单独计算的复唱时间，不受装备和状态的影响",
        "dmg": 180
      },
      {
        "name": "热分裂弹",
        "lv": 54,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：200\n追加效果：获得5点枪管热度",
        "dmg": 200
      },
      {
        "name": "策动",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "一定时间内，令自身和周围队员所受到的伤害减轻10%\n持续时间：15秒\n无法与吟游诗人的行吟、舞者的防守之桑巴效果叠加",
        "duration": 15
      },
      {
        "name": "钻头",
        "lv": 58,
        "type": "战技",
        "read": 0,
        "cd": 20,
        "intro": "对目标发动物理攻击　威力：700\n该战技不仅有单独计算的复唱时间，还会与毒菌冲击共享复唱时间,该战技有单独计算的复唱时间",
        "dmg": 700
      },
      {
        "name": "热独头弹",
        "lv": 60,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：热分裂弹　连击中威力：300\n连击成功：获得5点枪管热度",
        "dmg": 300
      },
      {
        "name": "热狙击弹",
        "lv": 64,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：热独头弹　连击中威力：400\n连击成功：获得5点枪管热度\n连击成功：获得10点电能",
        "dmg": 400
      },
      {
        "name": "枪管加热",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "获得50点枪管热度\n发动条件：自身处于战斗状态"
      },
      {
        "name": "火焰喷射器",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "持续向自身前方发出扇形范围攻击\n每秒对范围内的敌人造成伤害　威力：100　持续时间：10秒\n效果时间内发动技能或进行移动、转身都会立即解除火焰喷射器\n发动之后会停止自动攻击\n该能力不仅有单独计算的复唱时间，还会与战技共享复唱时间",
        "dmg": 100,
        "duration": 10
      },
      {
        "name": "毒菌冲击",
        "lv": 72,
        "type": "战技",
        "read": 0,
        "cd": 20,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：60\n追加效果：持续伤害\n威力：60　持续时间：15秒\n该战技不仅有单独计算的复唱时间，还会与钻头共享复唱时间",
        "dmg": 60,
        "duration": 15
      },
      {
        "name": "空气锚",
        "lv": 76,
        "type": "战技",
        "read": 0,
        "cd": 40,
        "intro": "对目标发动物理攻击　威力：700\n追加效果：获得20点电能\n该战技有单独计算的复唱时间",
        "dmg": 700
      },
      {
        "name": "后式自走人偶",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 6,
        "cost": "「电能」50",
        "intro": "启动后式自走人偶\n后式自走人偶的运转时间随发动该技能时消耗的电能而变动\n最长运转时间：20秒\n运转时间结束后，或发动超档后式人偶后，后式自走人偶会被回收\n发动条件：电能50点以上\n与超档后式人偶共享复唱时间"
      },
      {
        "name": "超档后式人偶",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "命令设置的后式自走人偶发动打桩枪\n发动条件：后式自走人偶处于设置状态\n与后式自走人偶共享复唱时间"
      },
      {
        "name": "铁臂拳",
        "lv": 80,
        "type": "战技",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标发动物理攻击　威力：150\n\n※该技能无法设置到热键栏",
        "dmg": 150
      },
      {
        "name": "滚轮冲",
        "lv": 80,
        "type": "战技",
        "read": 0,
        "cd": 3,
        "intro": "冲向目标并发动物理攻击　威力：300\n\n※该技能无法设置到热键栏",
        "dmg": 300
      },
      {
        "name": "打桩枪",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "对目标发动物理攻击　威力：800\n该技能的威力受设置后式自走人偶时消耗的电能影响\n发动后后式自走人偶消失\n所有者使用超档后式人偶或后式自走人偶的运转时间结束时，后式自走人偶会自动执行该技能\n\n※该技能无法设置到热键栏",
        "dmg": 800
      },{
        "name": "瀑泻",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：200\n追加效果（发动几率50%）：逆瀑泻预备　持续时间：20秒\n跳舞模式中该技能变为蔷薇曲脚步",
        "dmg": 200,
        "duration": 20
      },
      {
        "name": "喷泉",
        "lv": 2,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：瀑泻　连击中威力：250\n连击成功（发动几率50%）：坠喷泉预备　持续时间：20秒\n跳舞模式中该技能变为小鸟交叠跳",
        "dmg": 250,
        "duration": 20
      },
      {
        "name": "风车",
        "lv": 15,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：150\n追加效果（发动几率50%）：升风车预备　持续时间：20秒",
        "dmg": 150,
        "duration": 20
      },
      {
        "name": "标准舞步",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "进入跳舞模式，对自身附加标准舞步状态　持续时间：15秒\n跳舞模式中该技能变为标准舞步结束\n此时只能使用舞步技能、标准舞步结束、前冲步和职能技能\n该能力不仅有单独计算的复唱时间，还会与战技共享复唱时间\n发动技能后，舞步技能与结束技能会产生复唱时间",
        "duration": 15
      },
      {
        "name": "标准舞步结束",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 1.5,
        "intro": "对自身周围的敌人发动范围物理攻击\n舞步成功时追加效果：对自身以及带有自身舞伴状态的队员附加标准舞步结束和伶俐状态,舞步成功时追加效果：对自身以及带有自身舞伴状态的队员附加标准舞步结束状态\n持续时间：60秒\n该技能的威力与标准舞步结束状态的效果量随舞步技能的成功次数而有所不同\n成功0次时：威力500\n成功1次时：威力750且效果量为2%\n成功2次时：威力1000且效果量为5%\n攻击复数敌人时，对第一个之外的敌人威力降低75%\n发动技能后，战技和魔法会产生复唱时间\n\n※该技能无法设置到热键栏",
        "duration": 60
      },
      {
        "name": "逆瀑泻",
        "lv": 20,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：300\n追加效果（发动几率50%）：幻扇\n发动条件：逆瀑泻预备状态中\n跳舞模式中该技能变为绿叶小踢腿",
        "dmg": 300
      },
      {
        "name": "落刃雨",
        "lv": 25,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：100\n连击条件：风车　连击中威力：200\n连击成功（发动几率50%）：落血雨预备　持续时间：20秒",
        "dmg": 200,
        "duration": 20
      },
      {
        "name": "扇舞·序",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「幻扇」1",
        "intro": "对目标发动物理攻击　威力：150\n追加效果（发动几率50%）：扇舞·急预备　持续时间：20秒\n发动条件：幻扇",
        "dmg": 150,
        "duration": 20
      },
      {
        "name": "升风车",
        "lv": 35,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：250\n攻击复数敌人时，对第一个之外的敌人威力降低50%\n追加效果（发动几率50%）：幻扇\n发动条件：升风车预备状态中",
        "dmg": 250
      },
      {
        "name": "坠喷泉",
        "lv": 40,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：350\n追加效果（发动几率50%）：幻扇\n发动条件：坠喷泉预备状态中\n跳舞模式中该技能变为金冠趾尖转",
        "dmg": 350
      },
      {
        "name": "落血雨",
        "lv": 45,
        "type": "战技",
        "read": 0,
        "intro": "对自身周围的敌人发动范围物理攻击　威力：300\n攻击复数敌人时，对第一个之外的敌人威力降低50%\n追加效果（发动几率50%）：幻扇\n发动条件：落血雨预备状态中",
        "dmg": 300
      },
      {
        "name": "扇舞·破",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "cost": "「幻扇」1",
        "intro": "对自身周围的敌人发动范围物理攻击　威力：100\n追加效果（发动几率50%）：扇舞·急预备　持续时间：20秒\n发动条件：幻扇",
        "dmg": 100,
        "duration": 20
      },
      {
        "name": "前冲步",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "迅速移动到自身前方10米处\n积蓄次数：\n止步状态下无法发动"
      },
      {
        "name": "治疗之华尔兹",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "恢复自身及周围队员的体力\n恢复力：200\n追加效果：带有自身舞伴状态的队员也会产生同样的范围恢复效果"
      },
      {
        "name": "防守之桑巴",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "一定时间内，令自身和周围队员所受到的伤害减轻10%\n持续时间：15秒\n无法与吟游诗人的行吟、机工士的策动效果叠加",
        "duration": 15
      },
      {
        "name": "闭式舞姿",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "指定一名队员为目标，对自身附加闭式舞姿状态，对目标附加舞伴状态\n在该状态下发动标准舞步结束、进攻之探戈、治疗之华尔兹时，附加舞伴状态的队员也可以获得同样的效果\n再次发动时则取消该状态　持续时间：永久"
      },
      {
        "name": "解除闭式舞姿",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "取消闭式舞姿状态"
      },
      {
        "name": "进攻之探戈",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，自身的暴击发动率和直击发动率提高20%　持续时间：20秒\n追加效果：带有舞伴状态的队员也会附加同样的效果",
        "duration": 20
      },
      {
        "name": "扇舞·急",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "对目标及其周围敌人发动范围物理攻击　威力：200\n攻击复数敌人时，对目标之外的敌人威力降低50%\n发动条件：扇舞·急预备状态中",
        "dmg": 200
      },
      {
        "name": "技巧舞步",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "进入跳舞模式，对自身附加技巧舞步状态\n持续时间：15秒\n跳舞模式中该技能变为技巧舞步结束\n此时只能使用舞步技能、技巧舞步结束、前冲步和职能技能\n该能力不仅有单独计算的复唱时间，还会与战技共享复唱时间\n发动技能后，舞步技能与结束技能会产生复唱时间",
        "duration": 15
      },
      {
        "name": "技巧舞步结束",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 1.5,
        "intro": "对自身周围的敌人发动范围物理攻击\n舞步成功时追加效果：对自身及周围的队员附加技巧舞步结束和伶俐状态\n持续时间：20秒\n该技能的威力与技巧舞步结束状态的效果量随舞步技能的成功次数而有所不同\n成功0次时：威力500\n成功1次时：威力750且效果量为1%\n成功2次时：威力1000且效果量为2%\n成功3次时：威力1250且效果量为3%\n成功4次时：威力1500且效果量为5%\n攻击复数敌人时，对第一个之外的敌人威力降低75%\n发动技能后，战技和魔法会产生复唱时间\n\n※该技能无法设置到热键栏",
        "duration": 20
      },
      {
        "name": "百花争艳",
        "lv": 72,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "对自身附加逆瀑泻预备、坠喷泉预备、升风车预备、落血雨预备、扇舞·急预备状态"
      },
      {
        "name": "剑舞",
        "lv": 76,
        "type": "战技",
        "read": 0,
        "cost": "「伶俐」50",
        "intro": "对目标及其周围敌人发动范围物理攻击　威力：600\n攻击复数敌人时，对目标之外的敌人威力降低50%\n发动条件：伶俐50点",
        "dmg": 600
      },
      {
        "name": "即兴表演",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "原地起舞，对自身附加即兴表演状态　持续时间：15秒\n即兴表演效果：范围内的队员所受的治疗魔法效果提高10%\n自身处于战斗状态时，可以持续积累伶俐\n积累量随周围队员的人数而有所不同，人数越多，积累量越多\n效果时间内发动技能或进行移动、转身都会立即中断即兴表演\n发动之后会停止自动攻击",
        "duration": 15
      },
      {
        "name": "蔷薇曲脚步",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "发动蔷薇曲脚步舞步技能\n成功按照舞步量谱显示的顺序发动舞步技能，可以提高结束技能的效果\n发动技能后，舞步技能与结束技能会产生复唱时间\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "小鸟交叠跳",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "发动小鸟交叠跳舞步技能\n成功按照舞步量谱显示的顺序发动舞步技能，可以提高结束技能的效果\n发动技能后，舞步技能与结束技能会产生复唱时间\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "绿叶小踢腿",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "发动绿叶小踢腿舞步技能\n成功按照舞步量谱显示的顺序发动舞步技能，可以提高结束技能的效果\n发动技能后，舞步技能与结束技能会产生复唱时间\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "金冠趾尖转",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 1,
        "intro": "发动金冠趾尖转舞步技能\n成功按照舞步量谱显示的顺序发动舞步技能，可以提高结束技能的效果\n发动技能后，舞步技能与结束技能会产生复唱时间\n\n※该技能无法设置到热键栏"
      },{
        "name": "冰结",
        "lv": 1,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动冰属性魔法攻击　威力：180\n追加效果：灵极冰　持续时间：15秒\n在处于星极火状态时只会解除该状态\n持续时间：15秒",
        "dmg": 180,
        "duration": 15
      },
      {
        "name": "火炎",
        "lv": 2,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力800",
        "intro": "对目标发动火属性魔法攻击　威力：180\n追加效果：星极火　持续时间：15秒\n在处于灵极冰状态时只会解除该状态\n持续时间：15秒\n追加效果（发动几率40%）：下次发动爆炎不消耗魔力，同时也没有咏唱时间　持续时间：18秒",
        "dmg": 180,
        "duration": 18
      },
      {
        "name": "星灵移位",
        "lv": 4,
        "type": "能力",
        "read": 0,
        "cd": 5,
        "intro": "自身处于星极火或灵极冰的状态时迅速切换到另一状态的初级阶段"
      },
      {
        "name": "闪雷",
        "lv": 6,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力200",
        "intro": "对目标发动雷属性魔法攻击　威力：30\n追加效果：雷属性持续伤害\n威力：40　持续时间：18秒\n自身对目标附加的雷系魔法持续伤害效果同时只能存在一种\n追加效果（持续伤害每次起效时，发动几率10%）：\n下次发动的雷系魔法咏唱时间与消耗魔力均为0\n且命中时的威力会加算持续伤害的总和\n持续时间：18秒",
        "dmg": 40,
        "duration": 18
      },
      {
        "name": "催眠",
        "lv": 10,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力800",
        "intro": "令目标及其周围的敌人陷入睡眠状态　持续时间：30秒\n发动之后会停止自动攻击",
        "duration": 30
      },
      {
        "name": "冰冻",
        "lv": 12,
        "type": "魔法",
        "read": 2,
        "cost": "魔力800",
        "intro": "对周围的敌人发动冰属性范围魔法攻击　威力：50\n追加效果：灵极冰　持续时间：15秒\n在处于星极火状态时只会解除该状态\n持续时间：15秒",
        "dmg": 50,
        "duration": 15
      },
      {
        "name": "崩溃",
        "lv": 15,
        "type": "魔法",
        "read": 0,
        "cost": "魔力800",
        "intro": "对目标发动无属性魔法攻击　威力：100\n追加效果（发动几率20%）：伤害变为2倍",
        "dmg": 100
      },
      {
        "name": "烈炎",
        "lv": 18,
        "type": "魔法",
        "read": 3,
        "cost": "魔力1500",
        "intro": "对目标及其周围的敌人发动火属性范围魔法攻击　威力：80\n追加效果：星极火　持续时间：15秒\n在处于灵极冰状态时只会解除该状态\n持续时间：15秒",
        "dmg": 80,
        "duration": 15
      },
      {
        "name": "震雷",
        "lv": 26,
        "type": "魔法",
        "read": 3,
        "cost": "魔力400",
        "intro": "对目标发动雷属性魔法攻击　威力：50\n追加效果：雷击　持续时间：21秒\n雷击效果：雷属性持续伤害　威力：40　\n追加效果（雷击效果中，发动几率10%）：下次发动的闪雷、震雷、暴雷的咏唱时间与消耗魔力均为0，并且威力变为330\n持续时间：12秒",
        "dmg": 40,
        "duration": 12
      },
      {
        "name": "魔罩",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "为自身张开一个防护罩，在一定时间内能抵消相当于最大体力30%的伤害量\n抵消的伤害量超过上限时防护罩自动消失\n持续时间：20秒",
        "duration": 20
      },
      {
        "name": "魔泉",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "恢复最大魔力的30%"
      },
      {
        "name": "爆炎",
        "lv": 34,
        "type": "魔法",
        "read": 3.5,
        "cost": "魔力2000",
        "intro": "对目标发动火属性魔法攻击　威力：240\n追加效果：星极火最大档数　持续时间：15秒\n在处于灵极冰状态时会同时解除该状态",
        "dmg": 240,
        "duration": 15
      },
      {
        "name": "玄冰",
        "lv": 35,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力1000",
        "intro": "对目标及其周围的敌人发动冰属性范围魔法攻击　威力：100\n追加效果：灵极冰最大档数　持续时间：15秒\n在处于星极火状态时会同时解除该状态\n追加效果：1档灵极心\n灵极心效果：抵消星极火状态中发动火系魔法增加的魔力消耗\n另外，发动核爆时会消耗全部的灵极心将魔力消耗降为2/3",
        "dmg": 100,
        "duration": 15
      },
      {
        "name": "冰封",
        "lv": 40,
        "type": "魔法",
        "read": 3.5,
        "cost": "魔力800",
        "intro": "对目标发动冰属性魔法攻击　威力：240\n追加效果：灵极冰最大档数　持续时间：15秒\n在处于星极火状态时会同时解除该状态",
        "dmg": 240,
        "duration": 15
      },
      {
        "name": "暴雷",
        "lv": 45,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标发动雷属性魔法攻击　威力：70\n追加效果：雷属性持续伤害\n威力：40　持续时间：24秒\n自身对目标附加的雷系魔法持续伤害效果同时只能存在一种\n追加效果（持续伤害每次起效时，发动几率10%）：\n下次发动的雷系魔法咏唱时间与消耗魔力均为0\n且命中时的威力会加算持续伤害的总和\n持续时间：18秒",
        "dmg": 40,
        "duration": 18
      },
      {
        "name": "以太步",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "指定一名队员为目标，自身快速移动到目标身边\n止步状态下无法发动"
      },
      {
        "name": "核爆",
        "lv": 50,
        "type": "魔法",
        "read": 4,
        "cost": "全部魔力",
        "intro": "对目标及其周围的敌人发动火属性范围魔法攻击　威力：260\n攻击复数敌人时，对目标之外的敌人威力降低40%\n追加效果：星极火最大档数　持续时间：15秒\n在处于灵极冰状态时会同时解除该状态",
        "dmg": 260,
        "duration": 15
      },
      {
        "name": "黑魔纹",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "在自身脚下产生黑魔纹\n黑魔纹效果：自身的自动攻击间隔、魔法的咏唱及复唱时间缩短15%\n持续时间：30秒",
        "duration": 30
      },
      {
        "name": "激情咏唱",
        "lv": 54,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "效果时间内，自身发动的1次“崩溃”或“火炎”或“雷系魔法”必定触发“崩溃的追加效果”“火苗”“雷云”\n持续时间：15秒",
        "duration": 15
      },
      {
        "name": "天语",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "一定时间内，自身发动魔法攻击造成的伤害提高15%\n同时可以咏唱冰澈、炽炎、绝望、灵极魂\n星极火及灵极冰状态全部消失时天语状态也会同时消失\n追加效果：天语状态持续30秒可对自身附加通晓状态\n最大档数：2档　持续时间：永久\n发动条件：星极火或灵极冰状态中"
      },
      {
        "name": "冰澈",
        "lv": 58,
        "type": "魔法",
        "read": 2.8,
        "cost": "魔力800",
        "intro": "对目标发动冰属性魔法攻击　威力：300\n追加效果：3档灵极心\n灵极心效果：抵消星极火状态中发动火系魔法增加的魔力消耗\n另外，发动核爆时会消耗全部的灵极心将魔力消耗降为2/3\n发动条件：天语及灵极冰状态中",
        "dmg": 300
      },
      {
        "name": "炽炎",
        "lv": 60,
        "type": "魔法",
        "read": 2.8,
        "cost": "魔力800",
        "intro": "对目标发动火属性魔法攻击　威力：300\n发动条件：天语及星极火状态中",
        "dmg": 300
      },
      {
        "name": "魔纹步",
        "lv": 62,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "快速移动到自身留下的黑魔纹中心\n止步状态下无法发动"
      },
      {
        "name": "霹雷",
        "lv": 64,
        "type": "魔法",
        "read": 3,
        "cost": "魔力800",
        "intro": "对目标及其周围敌人发动雷属性范围魔法攻击　威力：50\n追加效果：雷属性持续伤害\n威力：30　持续时间：18秒\n自身对目标附加的雷系魔法持续伤害效果同时只能存在一种\n追加效果（持续伤害每次起效时，发动几率3%）：下次发动的雷系魔法咏唱时间与消耗魔力均为0\n且命中时的威力会加算持续伤害的总和\n持续时间：18秒",
        "dmg": 30,
        "duration": 18
      },
      {
        "name": "三连咏唱",
        "lv": 66,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "效果时间内，前3次咏唱的魔法没有任何咏唱时间　持续时间：15秒",
        "duration": 15
      },
      {
        "name": "秽浊",
        "lv": 70,
        "type": "魔法",
        "read": 2.5,
        "cost": "「通晓」1",
        "intro": "对目标及其周围敌人发动无属性范围魔法攻击　威力：650\n攻击复数目标时，每多1目标，对该目标威力降低10%，最低降为50%\n发动条件：通晓",
        "dmg": 650
      },
      {
        "name": "绝望",
        "lv": 72,
        "type": "魔法",
        "read": 3,
        "cost": "全部魔力",
        "intro": "对目标发动火属性魔法攻击　威力：380\n追加效果：星极火最大档数　持续时间：15秒\n发动条件：天语及星极火状态中",
        "dmg": 380,
        "duration": 15
      },
      {
        "name": "灵极魂",
        "lv": 76,
        "type": "魔法",
        "read": 0,
        "intro": "对自身附加灵极冰状态及1档灵极心\n灵极心效果：抵消星极火状态中发动火系魔法增加的魔力消耗\n另外，发动核爆时会消耗全部的灵极心将魔力消耗降为2/3\n发动条件：天语及灵极冰状态中"
      },
      {
        "name": "异言",
        "lv": 80,
        "type": "魔法",
        "read": 0,
        "cost": "「通晓」1",
        "intro": "对目标发动无属性魔法攻击　威力：750\n发动条件：通晓",
        "dmg": 750
      },
      {
        "name": "昏乱",
        "lv": 8,
        "type": "能力",
        "read": 0,
        "cd": 90,
        "intro": "一定时间内，令目标的智力与精神降低10%\n持续时间：10秒",
        "duration": 10
      },{
        "name": "毁灭",
        "lv": 1,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力200",
        "intro": "对目标发动无属性魔法攻击　威力：180",
        "dmg": 180
      },
      {
        "name": "毒菌",
        "lv": 2,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标附加无属性持续伤害状态\n威力：20　持续时间：30秒",
        "dmg": 20,
        "duration": 30
      },
      {
        "name": "医术",
        "lv": 4,
        "type": "魔法",
        "read": 1.5,
        "cost": "魔力400",
        "intro": "恢复目标的体力　恢复力：400"
      },
      {
        "name": "召唤",
        "lv": 4,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "召唤擅长远程范围攻击的召唤兽\n与召唤II、召唤III,召唤II共享复唱时间"
      },
      {
        "name": "瘴气",
        "lv": 6,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力500",
        "intro": "对目标发动无属性魔法攻击　威力：20\n追加效果：无属性持续伤害\n威力：20　持续时间：30秒",
        "dmg": 20,
        "duration": 30
      },
      {
        "name": "灵攻I",
        "lv": 10,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "令当前同行的召唤兽发动灵攻I对应的技能\n积蓄次数：2\n发动条件：自身处于战斗状态且召唤兽处于同行状态"
      },
      {
        "name": "复生",
        "lv": 12,
        "type": "魔法",
        "read": 8,
        "cost": "魔力2400",
        "intro": "令无法战斗的目标以衰弱状态重新振作起来"
      },
      {
        "name": "召唤II",
        "lv": 15,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "召唤擅长辅助召唤师的召唤兽\n与召唤、召唤III,召唤共享复唱时间"
      },
      {
        "name": "溃烂爆发",
        "lv": 18,
        "type": "能力",
        "read": 0,
        "cd": 5,
        "cost": "「以太超流」1",
        "intro": "对目标发动无属性魔法攻击\n该技能威力随自身在目标身上附加的毒菌、瘴气系持续伤害状态数量而变化\n无持续伤害时威力：100\n1种持续伤害时威力：200\n2种持续伤害时威力：300\n发动条件：以太超流",
        "dmg": 300
      },
      {
        "name": "能量吸收",
        "lv": 18,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标发动无属性魔法攻击　威力：150\n追加效果：恢复伤害量一定比例的体力\n同时恢复自身魔力\n追加效果：获得10点异想以太\n发动条件：以太超流",
        "dmg": 150
      },
      {
        "name": "猛毒菌",
        "lv": 26,
        "type": "魔法",
        "read": 0,
        "cost": "魔力600",
        "intro": "对目标附加无属性持续伤害状态\n威力：30　持续时间：30秒",
        "dmg": 30,
        "duration": 30
      },
      {
        "name": "灾祸",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "令目标所带的毒菌、瘴气系持续伤害状态和衰败向周围扩散\n,令目标所带的毒菌、瘴气系持续伤害状态向周围扩散\n扩散至复数目标时，对目标之外的敌人威力降低60%\n持续时间：扩散时各状态的剩余持续时间\n自身没有对目标施加毒菌、瘴气系持续伤害状态时无效\n追加效果（发动几率15%）：令各状态以原本持续时间扩散"
      },
      {
        "name": "召唤III",
        "lv": 30,
        "type": "能力",
        "read": 0,
        "cd": 3,
        "intro": "召唤擅长近身单体攻击的召唤兽\n与召唤、召唤II共享复唱时间"
      },
      {
        "name": "能量抽取",
        "lv": 35,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "对目标及其周围的敌人发动无属性范围魔法攻击　威力：40\n追加效果：2档以太超流\n与能量吸收共享复唱时间",
        "dmg": 40
      },
      {
        "name": "毁坏",
        "lv": 38,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：160",
        "dmg": 160
      },
      {
        "name": "迸裂",
        "lv": 40,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力400",
        "intro": "对目标及其周围的敌人发动无属性范围魔法攻击　威力：70\n变更内容",
        "dmg": 70
      },
      {
        "name": "灵攻II",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "intro": "令当前同行的召唤兽发动灵攻II对应的技能\n积蓄次数：2\n发动条件：自身处于战斗状态且召唤兽处于同行状态"
      },
      {
        "name": "内力迸发",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "令当前同行的召唤兽发动其最强技能\n发动条件：自身处于战斗状态且召唤兽处于同行状态"
      },
      {
        "name": "痛苦核爆",
        "lv": 52,
        "type": "能力",
        "read": 0,
        "cd": 5,
        "cost": "「以太超流」1",
        "intro": "对目标及其周围敌人发动无属性范围魔法攻击　威力：150\n发动条件：以太超流",
        "dmg": 150
      },
      {
        "name": "毁荡",
        "lv": 54,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力200",
        "intro": "对目标发动无属性魔法攻击　威力：200",
        "dmg": 200
      },
      {
        "name": "三重灾祸",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 50,
        "intro": "对目标同时施放剧毒菌和瘴暍,猛毒菌和瘴气\n持续时间：各魔法单独施放时的持续时间\n追加效果：衰败\n衰败效果：秘术师和召唤师发动毁灭系魔法及迸发攻击此目标时威力提高20　持续时间：30秒",
        "duration": 30
      },
      {
        "name": "龙神附体",
        "lv": 58,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "一定时间内，自身的魔法咏唱时间缩短2.5秒\n持续时间：15秒\n持续时间结束后获得附体深度\n追加效果：发动时重置三重灾祸的复唱时间\n发动条件：自身处于战斗状态且亚灵神巴哈姆特不处于显现状态，附身深度不满2档,\n发动条件：自身处于战斗状态\n与不死鸟附体共享复唱时间",
        "duration": 15
      },
      {
        "name": "死星核爆",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 15,
        "intro": "对目标及其周围敌人发动无属性范围魔法攻击　威力：400\n攻击复数敌人时，对目标之外的敌人威力降低50%\n发动后会取消龙神附体状态\n发动条件：龙神附体状态中",
        "dmg": 400
      },
      {
        "name": "毁绝",
        "lv": 62,
        "type": "魔法",
        "read": 0,
        "cost": "魔力200",
        "intro": "对目标发动无属性魔法攻击　威力：260\n发动条件：毁坏强化状态中\n\n※该技能无法设置到热键栏",
        "dmg": 260
      },
      {
        "name": "以太契约",
        "lv": 64,
        "type": "能力",
        "read": 0,
        "cd": 180,
        "intro": "命令召唤兽发动灵护\n发动条件：召唤兽处于同行状态"
      },
      {
        "name": "灵护",
        "lv": 64,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "为召唤兽周围的队员附加灵护状态\n灵护效果：攻击造成的伤害提高5%\n持续时间：15秒\n\n※该技能无法设置到热键栏",
        "duration": 15
      },
      {
        "name": "剧毒菌",
        "lv": 66,
        "type": "魔法",
        "read": 0,
        "cost": "魔力600",
        "intro": "对目标附加无属性持续伤害状态\n威力：40　持续时间：30秒",
        "dmg": 40,
        "duration": 30
      },
      {
        "name": "瘴暍",
        "lv": 66,
        "type": "魔法",
        "read": 2.5,
        "cost": "魔力500",
        "intro": "对目标发动无属性魔法攻击　威力：40\n追加效果：无属性持续伤害\n威力：40　持续时间：30秒",
        "dmg": 40,
        "duration": 30
      },
      {
        "name": "龙神召唤",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 30,
        "cost": "「附体深度」2",
        "intro": "令亚灵神巴哈姆特显现　显现时间：20秒\n当召唤者使用魔法攻击目标时，亚灵神巴哈姆特会发动真龙波\n亚灵神巴哈姆特显现时，之前召唤出的召唤兽会被暂时回收，并在显现时间结束后再次出现\n发动条件：召唤兽处于同行状态，且附体深度为2档\n龙神附体状态中无法发动"
      },
      {
        "name": "真龙波",
        "lv": 70,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标发动无属性魔法攻击　威力：150\n发动条件：亚灵神巴哈姆特显现中\n\n※该技能无法设置到热键栏",
        "dmg": 150
      },
      {
        "name": "龙神迸发",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "命令显现的亚灵神巴哈姆特发动死亡轮回\n发动条件：亚灵神巴哈姆特显现中\n与不死鸟迸发共享复唱时间"
      },
      {
        "name": "死亡轮回",
        "lv": 70,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "对目标及其周围敌人发动无属性范围魔法攻击　威力：650\n攻击复数敌人时，对目标之外的敌人威力降低50%\n发动条件：亚灵神巴哈姆特显现中\n\n※该技能无法设置到热键栏",
        "dmg": 650
      },
      {
        "name": "不死鸟附体",
        "lv": 72,
        "type": "能力",
        "read": 0,
        "cd": 60,
        "intro": "一定时间内，自身的魔法咏唱时间缩短2.5秒\n同时，毁荡和迸裂会分别变为灵泉之炎和炼狱之炎\n持续时间：20秒\n追加效果：发动时重置三重灾祸的复唱时间\n发动条件：亚灵神巴哈姆特显现结束\n满足发动条件后，龙神附体会变为不死鸟附体\n与龙神附体共享复唱时间\n\n※该技能无法设置到热键栏",
        "duration": 20
      },
      {
        "name": "灵泉之炎",
        "lv": 72,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动火属性魔法攻击　威力：250\n追加效果：灵泉\n持续时间：10秒\n发动条件：不死鸟附体状态中\n\n※该技能无法设置到热键栏",
        "dmg": 250,
        "duration": 10
      },
      {
        "name": "炼狱之炎",
        "lv": 72,
        "type": "魔法",
        "read": 0,
        "intro": "对目标及其周围的敌人发动火属性范围魔法攻击　威力：350\n攻击复数敌人时，对目标之外的敌人威力降低50%\n发动条件：不死鸟附体及灵泉状态中\n\n※该技能无法设置到热键栏",
        "dmg": 350
      },
      {
        "name": "不死鸟迸发",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": 10,
        "intro": "命令显现的亚灵神不死鸟发动天启\n发动条件：亚灵神不死鸟显现中\n满足发动条件后，龙神迸发变为不死鸟迸发\n与龙神迸发共享复唱时间\n\n※该技能无法设置到热键栏"
      },
      {
        "name": "不死鸟之翼",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "持续恢复周围队员的体力\n恢复力：100　持续时间：20秒\n\n※该技能无法设置到热键栏",
        "duration": 20
      },
      {
        "name": "赤焰",
        "lv": 80,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标发动火属性魔法攻击　威力：150\n发动条件：亚灵神不死鸟显现中\n\n※该技能无法设置到热键栏",
        "dmg": 150
      },
      {
        "name": "天启",
        "lv": 80,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "对目标及其周围的敌人发动火属性范围魔法攻击　威力：650\n攻击复数敌人时，对目标之外的敌人威力降低50%\n发动条件：亚灵神不死鸟显现中\n\n※该技能无法设置到热键栏",
        "dmg": 650
      },
      {
        "name": "突风",
        "lv": 1,
        "type": "魔法",
        "read": 1,
        "cd": 3,
        "intro": "对目标及其周围敌人发动风属性范围魔法攻击　威力：30\n\n※该技能无法设置到热键栏",
        "dmg": 30
      },
      {
        "name": "下行突风",
        "lv": 10,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标及其周围敌人发动风属性范围魔法攻击　威力：40\n\n※该技能无法设置到热键栏",
        "dmg": 40
      },
      {
        "name": "绿宝石之辉",
        "lv": 40,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标及其周围敌人发动风属性范围魔法攻击　威力：10\n追加效果：以目标为中心产生伤害区域\n威力：10　持续时间：15秒\n\n※该技能无法设置到热键栏",
        "dmg": 10,
        "duration": 15
      },
      {
        "name": "利爪",
        "lv": 1,
        "type": "魔法",
        "read": 0,
        "cd": 3,
        "intro": "对目标发动土属性魔法攻击　威力：40\n\n※该技能无法设置到热键栏",
        "dmg": 40
      },
      {
        "name": "黄宝石之辉",
        "lv": 10,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对召唤该召唤兽的召唤师附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于目标最大体力20%的伤害量\n持续时间：30秒\n\n※该技能无法设置到热键栏",
        "duration": 30
      },
      {
        "name": "黄宝石之光",
        "lv": 40,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对自身周围的敌人发动土属性范围魔法攻击　威力：60\n\n※该技能无法设置到热键栏",
        "dmg": 60
      },
      {
        "name": "烈风刃",
        "lv": 1,
        "type": "魔法",
        "read": 1,
        "cd": 3,
        "intro": "对目标及其周围敌人发动风属性范围魔法攻击　威力：40\n\n※该技能无法设置到热键栏",
        "dmg": 40
      },
      {
        "name": "大气风斩",
        "lv": 10,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标及其周围敌人发动风属性范围魔法攻击　威力：60\n\n※该技能无法设置到热键栏",
        "dmg": 60
      },
      {
        "name": "螺旋气流",
        "lv": 40,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标及其周围敌人发动风属性范围魔法攻击　威力：20\n追加效果：以目标为中心产生伤害区域\n威力：20　持续时间：15秒\n※该技能无法设置到热键栏",
        "dmg": 20,
        "duration": 15
      },
      {
        "name": "大气爆发",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "对目标及其周围敌人发动风属性范围魔法攻击　威力：350\n\n※该技能无法设置到热键栏",
        "dmg": 350
      },
      {
        "name": "碎岩",
        "lv": 1,
        "type": "魔法",
        "read": 0,
        "cd": 3,
        "intro": "对目标发动土属性魔法攻击　威力：60\n\n※该技能无法设置到热键栏",
        "dmg": 60
      },
      {
        "name": "大地之铠",
        "lv": 10,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对召唤该召唤兽的召唤师附加能够抵御一定伤害的防护罩\n该防护罩能够抵消相当于目标最大体力20%的伤害量\n持续时间：30秒\n\n※该技能无法设置到热键栏",
        "duration": 30
      },
      {
        "name": "山崩",
        "lv": 40,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对自身周围的敌人发动土属性范围魔法攻击　威力：70\n\n※该技能无法设置到热键栏",
        "dmg": 70
      },
      {
        "name": "大地之怒",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "对自身周围的敌人发动范围土属性魔法攻击 威力：200\n追加效果：生成范围伤害区域\n威力：20 持续时间：15秒\n\n※该技能无法设置到热键栏",
        "dmg": 20,
        "duration": 15
      },
      {
        "name": "燃火强袭",
        "lv": 1,
        "type": "魔法",
        "read": 0,
        "cd": 3,
        "intro": "对目标发动火属性魔法攻击　威力：80\n\n※该技能无法设置到热键栏",
        "dmg": 80
      },
      {
        "name": "深红旋风",
        "lv": 10,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对目标发动火属性魔法攻击　威力：100\n\n※该技能无法设置到热键栏",
        "dmg": 100
      },
      {
        "name": "烈焰碎击",
        "lv": 40,
        "type": "魔法",
        "read": 0,
        "cd": 1.5,
        "intro": "对自身周围的敌人发动火属性范围魔法攻击　威力：100\n\n※该技能无法设置到热键栏",
        "dmg": 100
      },
      {
        "name": "地狱之火炎",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": null,
        "intro": "向目标所在方向发出火属性扇形范围魔法攻击　威力：200\n追加效果：火属性持续伤害\n威力：20　持续时间：15秒\n\n※该技能无法设置到热键栏",
        "dmg": 20,
        "duration": 15
      }, {
        "name": "回刺",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：130\n平衡量谱中黑魔元与白魔元都在30点以上时，该技能变为魔回刺",
        "dmg": 130
      },
      {
        "name": "摇荡",
        "lv": 2,
        "type": "魔法",
        "read": 2,
        "cost": "魔力200",
        "intro": "对目标发动无属性魔法攻击　威力：180\n追加效果：获得3点黑魔元与3点白魔元",
        "dmg": 180
      },
      {
        "name": "赤闪雷",
        "lv": 4,
        "type": "魔法",
        "read": 5,
        "cost": "魔力300",
        "intro": "对目标发动雷属性魔法攻击　威力：310\n追加效果：获得11点黑魔元\n追加效果（发动几率50%）：赤火炎预备　持续时间：30秒",
        "dmg": 310,
        "duration": 30
      },
      {
        "name": "短兵相接",
        "lv": 6,
        "type": "能力",
        "read": 0,
        "cd": 40,
        "intro": "冲向目标并发动物理攻击　威力：130\n止步状态下无法发动",
        "dmg": 130
      },
      {
        "name": "赤疾风",
        "lv": 10,
        "type": "魔法",
        "read": 5,
        "cost": "魔力300",
        "intro": "对目标发动风属性魔法攻击　威力：310\n追加效果：获得11点白魔元\n追加效果（发动几率50%）：赤飞石预备　持续时间：30秒",
        "dmg": 310,
        "duration": 30
      },
      {
        "name": "散碎",
        "lv": 15,
        "type": "魔法",
        "read": 5,
        "cost": "魔力400",
        "intro": "对目标及其周围的敌人发动无属性范围魔法攻击　威力：120\n追加效果：获得3点黑魔元与3点白魔元",
        "dmg": 120
      },
      {
        "name": "赤震雷",
        "lv": 18,
        "type": "魔法",
        "read": 2,
        "cost": "魔力400",
        "intro": "对目标及其周围敌人发动雷属性魔法攻击　威力：120\n追加效果：获得7点黑魔元",
        "dmg": 120
      },
      {
        "name": "赤烈风",
        "lv": 22,
        "type": "魔法",
        "read": 2,
        "cost": "魔力400",
        "intro": "对目标及其周围敌人发动风属性魔法攻击　威力：120\n追加效果：获得7点白魔元",
        "dmg": 120
      },
      {
        "name": "赤火炎",
        "lv": 26,
        "type": "魔法",
        "read": 2,
        "cost": "魔力200",
        "intro": "对目标发动火属性魔法攻击　威力：270\n追加效果：获得9点黑魔元\n发动条件：赤火炎预备状态中",
        "dmg": 270
      },
      {
        "name": "赤飞石",
        "lv": 30,
        "type": "魔法",
        "read": 2,
        "cost": "魔力200",
        "intro": "对目标发动土属性魔法攻击　威力：270\n追加效果：获得9点白魔元\n发动条件：赤飞石预备状态中",
        "dmg": 270
      },
      {
        "name": "交击斩",
        "lv": 35,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：回刺或魔回刺　连击中威力：150\n平衡量谱中黑魔元与白魔元都在25点以上时，该技能变为魔交击斩",
        "dmg": 150
      },
      {
        "name": "移转",
        "lv": 40,
        "type": "能力",
        "read": 0,
        "cd": 35,
        "intro": "对目标发动物理攻击　威力：200\n追加效果：后跳15米距离\n止步状态下无法发动\n与交剑共享复唱时间",
        "dmg": 200
      },
      {
        "name": "飞刺",
        "lv": 45,
        "type": "能力",
        "read": 0,
        "cd": 25,
        "intro": "对目标发动物理攻击　威力：420",
        "dmg": 420
      },
      {
        "name": "连攻",
        "lv": 50,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n连击条件：交击斩或魔交击斩\n连击中威力：230\n平衡量谱中黑魔元与白魔元都在25点以上时，该技能变为魔连攻",
        "dmg": 230
      },
      {
        "name": "促进",
        "lv": 50,
        "type": "能力",
        "read": 0,
        "cd": 35,
        "intro": "一定时间内，下次能附加赤火炎预备状态与赤飞石预备状态的技能追加效果发动率变为100%\n持续时间：10秒",
        "duration": 10
      },
      {
        "name": "划圆斩",
        "lv": 52,
        "type": "战技",
        "read": 0,
        "intro": "向目标所在方向发出扇形范围物理攻击　威力：60\n平衡量谱中黑魔元与白魔元都在20点以上时，该技能变为魔划圆斩",
        "dmg": 60
      },
      {
        "name": "赤治疗",
        "lv": 54,
        "type": "魔法",
        "read": 2,
        "cost": "魔力500",
        "intro": "恢复目标的体力　恢复力：350"
      },
      {
        "name": "六分反击",
        "lv": 56,
        "type": "能力",
        "read": 0,
        "cd": 35,
        "intro": "对目标及其周围敌人发动范围物理攻击　威力：350\n攻击复数敌人时，对目标之外的敌人威力降低50%",
        "dmg": 350
      },
      {
        "name": "鼓励",
        "lv": 58,
        "type": "能力",
        "read": 0,
        "cd": 120,
        "intro": "一定时间内，自身发动魔法攻击造成的伤害提高10%\n持续时间：20秒\n此效果每4秒降低2%\n追加效果：令周围队员发动物理攻击造成的伤害提高10%\n持续时间：20秒\n此效果每4秒降低2%",
        "duration": 20
      },
      {
        "name": "倍增",
        "lv": 60,
        "type": "能力",
        "read": 0,
        "cd": 110,
        "intro": "当前平衡量谱中积累的量值翻倍\n追加效果：重置短兵相接和转移以及交剑的复唱时间\n追加效果：自身发动魔法攻击造成的伤害提高5%\n持续时间：10秒\n此技能会中断连击",
        "duration": 10
      },
      {
        "name": "震荡",
        "lv": 62,
        "type": "魔法",
        "read": 2,
        "cost": "魔力200",
        "intro": "对目标发动无属性魔法攻击　威力：250\n追加效果：获得3点黑魔元与3点白魔元",
        "dmg": 250
      },
      {
        "name": "赤复活",
        "lv": 64,
        "type": "魔法",
        "read": 10,
        "cost": "魔力2400",
        "intro": "令无法战斗的目标以衰弱状态重新振作起来"
      },
      {
        "name": "冲击",
        "lv": 66,
        "type": "魔法",
        "read": 5,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：270\n追加效果：获得4点黑魔元与4点白魔元\n发动条件：冲击预备状态中",
        "dmg": 270
      },
      {
        "name": "赤核爆",
        "lv": 68,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动火属性魔法攻击　威力：600\n连击条件：魔连攻\n追加效果：获得21点黑魔元\n追加效果（发动几率20%）：赤火炎预备　持续时间：30秒\n发动时白魔元高于黑魔元则100%发动追加效果\n发动条件：魔连攻成功时\n若满足发动条件，则赤闪雷变为赤核爆\n\n※该技能无法设置到热键栏",
        "dmg": 600,
        "duration": 30
      },
      {
        "name": "赤神圣",
        "lv": 70,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：600\n连击条件：魔连攻\n追加效果：获得21点白魔元\n追加效果（发动几率20%）：赤飞石预备　持续时间：30秒\n发动时黑魔元高于白魔元则100%发动追加效果\n发动条件：魔连攻成功时\n若满足发动条件，则赤疾风变为赤神圣\n\n※该技能无法设置到热键栏",
        "dmg": 600,
        "duration": 30
      },
      {
        "name": "交剑",
        "lv": 72,
        "type": "能力",
        "read": 0,
        "cd": 35,
        "intro": "对目标发动物理攻击　威力：150\n与移转共享复唱时间",
        "dmg": 150
      },
      {
        "name": "续斩",
        "lv": 76,
        "type": "战技",
        "read": 0,
        "intro": "对目标发动物理攻击　威力：100\n平衡量谱中黑魔元与白魔元都在5点以上时，该技能变为魔续斩",
        "dmg": 100
      },
      {
        "name": "焦热",
        "lv": 80,
        "type": "魔法",
        "read": 0,
        "cost": "魔力400",
        "intro": "对目标发动无属性魔法攻击　威力：700\n连击条件：赤核爆或赤神圣\n追加效果：获得7点黑魔元与7点白魔元\n发动条件：赤核爆或赤神圣成功时\n满足发动条件后，震荡变为焦热\n\n※该技能无法设置到热键栏",
        "dmg": 700
      },
      {
        "name": "魔回刺",
        "lv": 1,
        "type": "战技",
        "read": 0,
        "cd": 1.5,
        "cost": "「黑魔元」30\n「白魔元」30",
        "intro": "对目标发动无属性魔法攻击　威力：210\n发动条件：黑魔元、白魔元各30点\n\n※该技能无法设置到热键栏",
        "dmg": 210
      },
      {
        "name": "魔交击斩",
        "lv": 35,
        "type": "战技",
        "read": 0,
        "cd": 1.5,
        "cost": "「黑魔元」25\n「白魔元」25",
        "intro": "对目标发动无属性魔法攻击　威力：100\n连击条件：回刺或魔回刺　连击中威力：290\n发动条件：黑魔元、白魔元各25点\n\n※该技能无法设置到热键栏",
        "dmg": 290
      },
      {
        "name": "魔连攻",
        "lv": 50,
        "type": "战技",
        "read": 0,
        "cd": 2.2,
        "cost": "「黑魔元」25\n「白魔元」25",
        "intro": "对目标发动无属性魔法攻击　威力：100\n连击条件：魔交击斩\n连击中威力：470\n发动条件：黑魔元、白魔元各25点\n\n※该技能无法设置到热键栏",
        "dmg": 470
      },
      {
        "name": "魔划圆斩",
        "lv": 52,
        "type": "战技",
        "read": 0,
        "cd": 1.5,
        "cost": "「黑魔元」20\n「白魔元」20",
        "intro": "向目标所在方向发出扇形范围魔法攻击　威力：200\n发动条件：黑魔元、白魔元各20点\n\n※该技能无法设置到热键栏",
        "dmg": 200
      },
      {
        "name": "魔续斩",
        "lv": 76,
        "type": "战技",
        "read": 0,
        "cd": 2.2,
        "cost": "「黑魔元」5\n「白魔元」5",
        "intro": "对目标发动无属性魔法攻击　威力：250\n发动条件：黑魔元与白魔元各5点\n\n※该技能无法设置到热键栏",
        "dmg": 250
      },
    
  ]
var allSkillMap={}; //技能map
for(var i=0;i<allSkills.length;++i){
    var skill=allSkills[i];
    allSkillMap[skill.name]=skill;
}
var jobTypeSkill={ //职能技能
    坦克:["雪仇","铁壁","插言","挑衅","退避","亲疏自行"],
    奶妈:["即刻咏唱","醒梦","沉稳咏唱","营救"],
    近战:["内丹","牵制","扫腿","浴血","亲疏自行","真北"],
    远敏:["内丹","亲疏自行"],
    魔法:["昏乱","即刻咏唱","醒梦","沉稳咏唱"]
}
var jobSkill={ //职业拥有技能
    //--------------T
    骑士:{
        type:"坦克",
        list:["战逃反应","钢铁信念","深奥之灵","盾阵","预警","保护","厄运流转","神圣领域","圣光幕帘","干预","安魂祈祷","武装戍卫","调停"],
        gcd:["先锋剑","暴乱剑","全蚀斩","盾牌猛击","投盾","战女神之怒","日珥斩","沥血剑","深仁厚泽","王权剑","圣灵","圣环","赎罪剑","悔罪"]
    },
    战士:{
        type:"坦克",
        list:["狂暴","守护","战栗","复仇","死斗","战嚎","原初的直觉","泰然自若","猛攻","动乱","摆脱","原初的解放","原初的勇猛"],
        gcd:["重劈","凶残裂","超压斧","飞斧","暴风斩","原初之魂","秘银暴风","钢铁旋风","暴风碎","裂石飞环","地毁人亡","混沌旋风","狂魂"]
    },
    暗黑骑士:{
        type:"坦克",
        list:["深恶痛绝","暗黑波动","嗜血","暗影墙","暗黑锋","弃明投暗","行尸走肉","腐秽大地","跳斩","吸血深渊","精雕怒斩","血乱","至黑之夜","暗影波动","暗影锋","暗黑布道","掠影示现"],
        gcd:["重斩","吸收斩","释放","伤残","噬魂斩","血溅","寂灭","刚魂"]
    },
    绝枪战士:{
        type:"坦克",
        list:["无情","伪装","王室亲卫","危险领域","星云","极光","超火流星","粗分斩","弓形冲波","光之心","石之心","续剑","撕喉","裂膛","穿目","血壤","爆破领域"],
        gcd:["利刃斩","残暴弹","恶魔切","闪雷弹","迅连斩","爆发击","恶魔杀","音速破","烈牙","猛兽爪","凶禽爪","命运之环"]
    },
    //-------N
    白魔:{
        type:"奶妈",
        list:["水流环","神速咏唱","天赐祝福","庇护所","法令","无中生有","神名","神祝祷","全大赦","节制"],
        gcd:["飞石","治疗","疾风","医治","复活","坚石","救疗","再生","愈疗","神圣","烈风","医济","安慰之心","垒石","崩石","天辉","闪耀","苦难之心","狂喜之心","沉静","康复"]
    },
    占星术士:{
        type:"奶妈",
        list:["光速","先天禀赋","抽卡","白昼学派","奥秘卡废弃","出卡","重抽","黑夜学派","星位合图","小奥秘卡","占卜","命运之轮","天星冲日","地星","星体爆轰","袖内抽卡","天星交错","天宫图","天宫图","中间学派"],
        gcd:["凶星","吉星","烧灼","阳星","生辰","福星","吉星相位","阳星相位","重力","炽灼","灾星","祸星","焚灼","煞星","沉静","康复"]
},
    学者:{
        type:"奶妈",
        list:["仙光的低语","异想的幻光","以太超流","能量吸收","生命活性法","野战治疗阵","不屈不挠之策","展开战术","应急战术","转化","深谋远虑之策","连环计","以太契约","融光解除","秘策","异想的祥光","炽天召唤","慰藉","仙光的低语","异想的幻光","异想的融光","异想的祥光","天使的低语","炽天的幻光","慰藉"],
        gcd:["毁灭","毒菌","医术","朝日召唤","夕月召唤","复生","猛毒菌","鼓舞激励之策","士气高扬之策","毁坏","破阵法","气炎法","魔炎法","蛊毒法","死炎法","仙光的拥抱","炽天的幕帘","沉静","康复"]
    },
    //--------DPS
    武僧:{
        type:"近战",
        list:["金刚体势","疾风体势","罗刹冲","红莲体势","真言","震脚","斗气","阴阳斗气斩","苍气炮","斗魂旋风脚","金刚极意","红莲极意","义结金兰","万象斗气圈","无我"],
        gcd:["连击","正拳","崩拳","双掌打","破坏神冲","破碎拳","地烈劲","四面脚","双龙脚","演武","六合星导脚"]
    },
    龙骑:{
        type:"近战",
        list:["龙剑","猛枪","跳跃","回避跳跃","破碎冲","龙炎冲","战斗连祷","苍天龙血","武神枪","巨龙视线","幻象冲","死者之岸","高跳","坠星冲"],
        gcd:["精准刺","贯通刺","贯穿尖","开膛枪","直刺","死天枪","樱花怒放","龙牙龙爪","龙尾大回旋","音速刺","山境酷刑","龙眼雷电"]
    },
    忍者:{
        type:"近战",
        list:["残影","隐遁","夺取","攻其不备","天之印","忍术","地之印","缩地","人之印","生杀予夺","梦幻三段","断绝","通灵之术·大虾蟆","六道轮回","天地人","命水","分身之术","风魔手里剑","火遁之术","雷遁之术","冰遁之术","风遁之术","土遁之术","水遁之术","劫火灭却之术","冰晶乱流之术"],
        gcd:["双刃旋","绝风","飞刀","旋风刃","影牙","血雨飞花","八卦无刃杀","强甲破点突"]
    },
    武士:{
        type:"近战",
        list:["心眼","明镜止水","必杀剑·回天","必杀剑·晓天","必杀剑·夜天","慈眼","默想","必杀剑·震天","必杀剑·九天","必杀剑·星眼","叶隐","意气冲天","必杀剑·红莲","必杀剑·闪影","燕回返","照破","回返彼岸花","回返五剑","回返雪月花"],
        gcd:["刃风","阵风","燕飞","士风","风雅","月光","居合术","满月","花车","樱花","雪风","彼岸花","天下五剑","纷乱雪月花"]
    },
    //------远敏
    诗人:{
        type:"远敏",
        list:["猛者强击","失血箭","后跃射击","光阴神的礼赞凯歌","纷乱箭","死亡箭雨","战斗之声","完美音调","九天连箭","侧风诱导箭","行吟","大地神的抒情恋歌","影噬箭"],
        gcd:["强力射击","直线射击","毒咬箭","连珠箭","风蚀箭","贤者的叙事谣","军神的赞美歌","放浪神的小步舞曲","伶牙俐齿","烈毒咬箭","狂风蚀箭","辉煌箭","爆发射击","绝峰箭"]
    },
    机工:{
        type:"远敏",
        list:["整备","虹吸弹","超荷","车式浮空炮塔","超档车式炮塔","超负荷车式炮塔","野火","起爆","弹射","策动","枪管加热","火焰喷射器","后式自走人偶","超档后式人偶","打桩枪"],
        gcd:["分裂弹","独头弹","热弹","散射","狙击弹","热冲击","自动弩","热分裂弹","钻头","热独头弹","热狙击弹","毒菌冲击","空气锚","铁臂拳","滚轮冲"]
    },
    舞者:{
        type:"远敏",
        list:["标准舞步","标准舞步结束","扇舞·序","扇舞·破","前冲步","治疗之华尔兹","防守之桑巴","闭式舞姿","解除闭式舞姿","进攻之探戈","扇舞·急","技巧舞步","技巧舞步结束","百花争艳","即兴表演","蔷薇曲脚步","小鸟交叠跳","绿叶小踢腿","金冠趾尖转"],
        gcd:["瀑泻","喷泉","风车","逆瀑泻","落刃雨","升风车","坠喷泉","落血雨","剑舞"]
    },
    //----------魔法
    召唤:{
        type:"魔法",
        list:["召唤","灵攻I","召唤II","溃烂爆发","能量吸收","灾祸","召唤III","能量抽取","灵攻II","内力迸发","痛苦核爆","三重灾祸","龙神附体","死星核爆","以太契约","灵护","龙神召唤","龙神迸发","死亡轮回","不死鸟附体","不死鸟迸发","不死鸟之翼","天启","大气爆发","大地之怒","地狱之火炎"],
        gcd:["毁灭","毒菌","医术","瘴气","复生","猛毒菌","毁坏","迸裂","毁荡","毁绝","剧毒菌","瘴暍"]
    },
    赤魔:{
        type:"魔法",
        list:["短兵相接","移转","飞刺","促进","六分反击","鼓励","倍增","交剑"],
        gcd:["回刺","摇荡","赤闪雷","赤疾风","散碎","赤震雷","赤烈风","赤火炎","赤飞石","交击斩","连攻","划圆斩","赤治疗","震荡","赤复活","冲击","赤核爆","赤神圣","续斩","焦热","魔回刺","魔交击斩","魔连攻","魔划圆斩","魔续斩"]
    },
    黑魔:{
        type:"魔法",
        list:["星灵移位","魔罩","魔泉","以太步","黑魔纹","激情咏唱","天语","魔纹步","三连咏唱"],
        gcd:["冰结","火炎","闪雷","催眠","冰冻","崩溃","烈炎","震雷","爆炎","玄冰","冰封","暴雷","核爆","冰澈","炽炎","霹雷","秽浊","绝望","灵极魂","异言"]
    },
}
var jobTypeJob={}; //职能对应职业 { 坦克:["战士","骑士",...] }
for(let jobName in jobSkill){ //加工职业技能
    let job=jobSkill[jobName];

    //---按职能划分
    if(!jobTypeJob[job.type]){
        jobTypeJob[job.type]=[];
    }
    jobTypeJob[job.type].push(jobName);

    job.skills={
        jobType:[],
        job:[],
        gcd:[],
    }
    //增加职能技能
    var jobTypeSkillList=jobTypeSkill[job.type];
    for(var skillName of jobTypeSkillList){
        var skill=allSkillMap[skillName];
        job.skills.jobType.push(skill);
    }
    //增加职业技能
    for(var skillName of job.list){
        var skill=allSkillMap[skillName];
        job.skills.job.push(skill);
    }
    //增加职业的GCD技能
    for(var skillName of job.gcd){
        var skill=allSkillMap[skillName]||{name:skillName};
        job.skills.gcd.push(skill);
    }
}
